betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rcm.h
/**
  *
  * @file    apm32f4xx_ddl_rcm.h
  * @brief   Header file of RCM DDL module.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APM32F4xx_DDL_RCM_H
#define APM32F4xx_DDL_RCM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx.h"

/** @addtogroup APM32F4xx_DDL_Driver
  * @{
  */

#if defined(RCM)

/** @defgroup RCM_DDL RCM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup RCM_DDL_Private_Variables RCM Private Variables
  * @{
  */

/**
  * @}
  */
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup RCM_DDL_Private_Macros RCM Private Macros
  * @{
  */
/**
  * @}
  */
#endif /*USE_FULL_DDL_DRIVER*/
/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup RCM_DDL_Exported_Types RCM Exported Types
  * @{
  */

/** @defgroup DDL_ES_CLOCK_FREQ Clocks Frequency Structure
  * @{
  */

/**
  * @brief  RCM Clocks Frequency Structure
  */
typedef struct
{
  uint32_t SYSCLK_Frequency;        /*!< SYSCLK clock frequency */
  uint32_t HCLK_Frequency;          /*!< HCLK clock frequency */
  uint32_t PCLK1_Frequency;         /*!< PCLK1 clock frequency */
  uint32_t PCLK2_Frequency;         /*!< PCLK2 clock frequency */
} DDL_RCM_ClocksTypeDef;

/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCM_DDL_Exported_Constants RCM Exported Constants
  * @{
  */

/** @defgroup RCM_DDL_EC_OSC_VALUES Oscillator Values adaptation
  * @brief    Defines used to adapt values of different oscillators
  * @note     These values could be modified in the user environment according to
  *           HW set-up.
  * @{
  */
#if !defined  (HSE_VALUE)
#if defined(APM32F403xx) || defined(APM32F402xx)
#define HSE_VALUE    8000000U   /*!< Value of the HSE oscillator in Hz */
#else
#define HSE_VALUE    25000000U  /*!< Value of the HSE oscillator in Hz */
#endif /* APM32F403xx || APM32F402xx */
#endif /* HSE_VALUE */

#if !defined  (HSI_VALUE)
#if defined(APM32F403xx) || defined(APM32F402xx)
#define HSI_VALUE    8000000U   /*!< Value of the HSI oscillator in Hz */
#else
#define HSI_VALUE    16000000U  /*!< Value of the HSI oscillator in Hz */
#endif /* APM32F403xx || APM32F402xx */
#endif /* HSI_VALUE */

#if !defined  (LSE_VALUE)
#define LSE_VALUE    32768U     /*!< Value of the LSE oscillator in Hz */
#endif /* LSE_VALUE */

#if !defined  (LSI_VALUE)
#if defined(APM32F403xx) || defined(APM32F402xx)
#define LSI_VALUE    35000U     /*!< Value of the LSI oscillator in Hz */
#else
#define LSI_VALUE    32000U     /*!< Value of the LSI oscillator in Hz */
#endif /* APM32F403xx || APM32F402xx */
#endif /* LSI_VALUE */

#if !defined  (EXTERNAL_CLOCK_VALUE)
#define EXTERNAL_CLOCK_VALUE    12288000U /*!< Value of the I2S_CKIN external oscillator in Hz */
#endif /* EXTERNAL_CLOCK_VALUE */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with DDL_RCM_WriteReg function
  * @{
  */
#define DDL_RCM_INT_LSIRDYCLR                RCM_INT_LSIRDYCLR     /*!< LSI Ready Interrupt Clear */
#define DDL_RCM_INT_LSERDYCLR                RCM_INT_LSERDYCLR     /*!< LSE Ready Interrupt Clear */
#define DDL_RCM_INT_HSIRDYCLR                RCM_INT_HSIRDYCLR     /*!< HSI Ready Interrupt Clear */
#define DDL_RCM_INT_HSERDYCLR                RCM_INT_HSERDYCLR     /*!< HSE Ready Interrupt Clear */
#define DDL_RCM_INT_PLL1RDYCLR               RCM_INT_PLL1RDYCLR    /*!< PLL Ready Interrupt Clear */
#if defined(RCM_PLLI2S_SUPPORT)
#define DDL_RCM_INT_PLL2RDYCLR               RCM_INT_PLL2RDYCLR    /*!< PLLI2S Ready Interrupt Clear */
#endif /* RCM_PLLI2S_SUPPORT */
#define DDL_RCM_INT_CSSCLR                   RCM_INT_CSSCLR        /*!< Clock Security System Interrupt Clear */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with DDL_RCM_ReadReg function
  * @{
  */
#define DDL_RCM_INT_LSIRDYFLG                RCM_INT_LSIRDYFLG     /*!< LSI Ready Interrupt flag */
#define DDL_RCM_INT_LSERDYFLG                RCM_INT_LSERDYFLG     /*!< LSE Ready Interrupt flag */
#define DDL_RCM_INT_HSIRDYFLG                RCM_INT_HSIRDYFLG     /*!< HSI Ready Interrupt flag */
#define DDL_RCM_INT_HSERDYFLG                RCM_INT_HSERDYFLG     /*!< HSE Ready Interrupt flag */
#define DDL_RCM_INT_PLL1RDYFLG               RCM_INT_PLL1RDYFLG    /*!< PLL Ready Interrupt flag */
#if defined(RCM_PLLI2S_SUPPORT)
#define DDL_RCM_INT_PLL2RDYFLG               RCM_INT_PLL2RDYFLG    /*!< PLLI2S Ready Interrupt flag */
#endif /* RCM_PLLI2S_SUPPORT */
#define DDL_RCM_INT_CSSFLG                   RCM_INT_CSSFLG        /*!< Clock Security System Interrupt flag */
#define DDL_RCM_CSTS_LPWRRSTFLG              RCM_CSTS_LPWRRSTFLG   /*!< Low-Power reset flag */
#define DDL_RCM_CSTS_PINRSTFLG               RCM_CSTS_PINRSTFLG    /*!< PIN reset flag */
#define DDL_RCM_CSTS_PODRSTFLG               RCM_CSTS_PODRSTFLG    /*!< POR/PDR reset flag */
#define DDL_RCM_CSTS_SWRSTFLG                RCM_CSTS_SWRSTFLG     /*!< Software Reset flag */
#define DDL_RCM_CSTS_IWDTRSTFLG              RCM_CSTS_IWDTRSTFLG   /*!< Independent Watchdog reset flag */
#define DDL_RCM_CSTS_WWDTRSTFLG              RCM_CSTS_WWDTRSTFLG   /*!< Window watchdog reset flag */
#if defined(RCM_CSTS_BORRSTFLG)
#define DDL_RCM_CSTS_BORRSTFLG               RCM_CSTS_BORRSTFLG    /*!< BOR reset flag */
#endif /* RCM_CSTS_BORRSTFLG */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_IT IT Defines
  * @brief    IT defines which can be used with DDL_RCM_ReadReg and  DDL_RCM_WriteReg functions
  * @{
  */
#define DDL_RCM_INT_LSIRDYEN               RCM_INT_LSIRDYEN      /*!< LSI Ready Interrupt Enable */
#define DDL_RCM_INT_LSERDYEN               RCM_INT_LSERDYEN      /*!< LSE Ready Interrupt Enable */
#define DDL_RCM_INT_HSIRDYEN               RCM_INT_HSIRDYEN      /*!< HSI Ready Interrupt Enable */
#define DDL_RCM_INT_HSERDYEN               RCM_INT_HSERDYEN      /*!< HSE Ready Interrupt Enable */
#define DDL_RCM_INT_PLL1RDYEN              RCM_INT_PLL1RDYEN     /*!< PLL Ready Interrupt Enable */
#if defined(RCM_PLLI2S_SUPPORT)
#define DDL_RCM_INT_PLL2RDYEN              RCM_INT_PLL2RDYEN     /*!< PLLI2S Ready Interrupt Enable */
#endif /* RCM_PLLI2S_SUPPORT */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_SYS_CLKSOURCE  System clock switch
  * @{
  */
#define DDL_RCM_SYS_CLKSOURCE_HSI           RCM_CFG_SCLKSEL_HSI    /*!< HSI selection as system clock */
#define DDL_RCM_SYS_CLKSOURCE_HSE           RCM_CFG_SCLKSEL_HSE    /*!< HSE selection as system clock */
#define DDL_RCM_SYS_CLKSOURCE_PLL           RCM_CFG_SCLKSEL_PLL    /*!< PLL selection as system clock */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_SYS_CLKSOURCE_STATUS  System clock switch status
  * @{
  */
#define DDL_RCM_SYS_CLKSOURCE_STATUS_HSI    RCM_CFG_SCLKSELSTS_HSI   /*!< HSI used as system clock */
#define DDL_RCM_SYS_CLKSOURCE_STATUS_HSE    RCM_CFG_SCLKSELSTS_HSE   /*!< HSE used as system clock */
#define DDL_RCM_SYS_CLKSOURCE_STATUS_PLL    RCM_CFG_SCLKSELSTS_PLL   /*!< PLL used as system clock */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_SYSCLK_DIV  AHB prescaler
  * @{
  */
#define DDL_RCM_SYSCLK_DIV_1                RCM_CFG_AHBPSC_DIV1   /*!< SYSCLK not divided */
#define DDL_RCM_SYSCLK_DIV_2                RCM_CFG_AHBPSC_DIV2   /*!< SYSCLK divided by 2 */
#define DDL_RCM_SYSCLK_DIV_4                RCM_CFG_AHBPSC_DIV4   /*!< SYSCLK divided by 4 */
#define DDL_RCM_SYSCLK_DIV_8                RCM_CFG_AHBPSC_DIV8   /*!< SYSCLK divided by 8 */
#define DDL_RCM_SYSCLK_DIV_16               RCM_CFG_AHBPSC_DIV16  /*!< SYSCLK divided by 16 */
#define DDL_RCM_SYSCLK_DIV_64               RCM_CFG_AHBPSC_DIV64  /*!< SYSCLK divided by 64 */
#define DDL_RCM_SYSCLK_DIV_128              RCM_CFG_AHBPSC_DIV128 /*!< SYSCLK divided by 128 */
#define DDL_RCM_SYSCLK_DIV_256              RCM_CFG_AHBPSC_DIV256 /*!< SYSCLK divided by 256 */
#define DDL_RCM_SYSCLK_DIV_512              RCM_CFG_AHBPSC_DIV512 /*!< SYSCLK divided by 512 */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_APB1_DIV  APB low-speed prescaler (APB1)
  * @{
  */
#define DDL_RCM_APB1_DIV_1                  RCM_CFG_APB1PSC_DIV1  /*!< HCLK not divided */
#define DDL_RCM_APB1_DIV_2                  RCM_CFG_APB1PSC_DIV2  /*!< HCLK divided by 2 */
#define DDL_RCM_APB1_DIV_4                  RCM_CFG_APB1PSC_DIV4  /*!< HCLK divided by 4 */
#define DDL_RCM_APB1_DIV_8                  RCM_CFG_APB1PSC_DIV8  /*!< HCLK divided by 8 */
#define DDL_RCM_APB1_DIV_16                 RCM_CFG_APB1PSC_DIV16 /*!< HCLK divided by 16 */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_APB2_DIV  APB high-speed prescaler (APB2)
  * @{
  */
#define DDL_RCM_APB2_DIV_1                  RCM_CFG_APB2PSC_DIV1  /*!< HCLK not divided */
#define DDL_RCM_APB2_DIV_2                  RCM_CFG_APB2PSC_DIV2  /*!< HCLK divided by 2 */
#define DDL_RCM_APB2_DIV_4                  RCM_CFG_APB2PSC_DIV4  /*!< HCLK divided by 4 */
#define DDL_RCM_APB2_DIV_8                  RCM_CFG_APB2PSC_DIV8  /*!< HCLK divided by 8 */
#define DDL_RCM_APB2_DIV_16                 RCM_CFG_APB2PSC_DIV16 /*!< HCLK divided by 16 */
/**
  * @}
  */

