betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rcm.h
/** @defgroup RCM_DDL_EC_MCOxSOURCE  MCO source selection
  * @{
  */
#if defined(RCM_CFG_MCOSEL)
#define DDL_RCM_MCO1SOURCE_NOCLOCK          RCM_CFG_MCOSEL_NOCLOCK                                       /*!< MCO output disabled, no clock on MCO */
#define DDL_RCM_MCO1SOURCE_SYSCLK           RCM_CFG_MCOSEL_SYSCLK                                        /*!< SYSCLK selection as MCO source */
#define DDL_RCM_MCO1SOURCE_HSI              RCM_CFG_MCOSEL_HSI                                           /*!< HSI selection as MCO source */
#define DDL_RCM_MCO1SOURCE_HSE              RCM_CFG_MCOSEL_HSE                                           /*!< HSE selection as MCO source */
#define DDL_RCM_MCO1SOURCE_PLLCLK_DIV_2     RCM_CFG_MCOSEL_PLLCLK_DIV2                                   /*!< PLLCLK divided by 2 selection as MCO source */
#endif /* RCM_CFG_MCOSEL */
#if defined(RCM_CFG_MCO1SEL)
#define DDL_RCM_MCO1SOURCE_HSI              (uint32_t)(RCM_CFG_MCO1SEL|0x00000000U)                      /*!< HSI selection as MCO1 source */
#define DDL_RCM_MCO1SOURCE_LSE              (uint32_t)(RCM_CFG_MCO1SEL|(RCM_CFG_MCO1SEL_0 >> 16U))       /*!< LSE selection as MCO1 source */
#define DDL_RCM_MCO1SOURCE_HSE              (uint32_t)(RCM_CFG_MCO1SEL|(RCM_CFG_MCO1SEL_1 >> 16U))       /*!< HSE selection as MCO1 source */
#define DDL_RCM_MCO1SOURCE_PLLCLK           (uint32_t)(RCM_CFG_MCO1SEL|((RCM_CFG_MCO1SEL_1|RCM_CFG_MCO1SEL_0) >> 16U))       /*!< PLLCLK selection as MCO1 source */
#endif /* RCM_CFG_MCO1SEL */
#if defined(RCM_CFG_MCO2SEL)
#define DDL_RCM_MCO2SOURCE_SYSCLK           (uint32_t)(RCM_CFG_MCO2SEL|0x00000000U)                      /*!< SYSCLK selection as MCO2 source */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F411xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define DDL_RCM_MCO2SOURCE_PLLI2S           (uint32_t)(RCM_CFG_MCO2SEL|(RCM_CFG_MCO2SEL_0 >> 16U))       /*!< PLLI2S selection as MCO2 source */
#endif /* APM32F405xx || APM32F407xx || APM32F411xx || APM32F415xx || APM32F417xx || APM32F465xx */
#define DDL_RCM_MCO2SOURCE_HSE              (uint32_t)(RCM_CFG_MCO2SEL|(RCM_CFG_MCO2SEL_1 >> 16U))       /*!< HSE selection as MCO2 source */
#define DDL_RCM_MCO2SOURCE_PLLCLK           (uint32_t)(RCM_CFG_MCO2SEL|((RCM_CFG_MCO2SEL_1|RCM_CFG_MCO2SEL_0) >> 16U))       /*!< PLLCLK selection as MCO2 source */
#endif /* RCM_CFG_MCO2SEL */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_MCOx_DIV  MCO prescaler
  * @{
  */
#if defined(RCM_CFG_MCO1PSC)
#define DDL_RCM_MCO1_DIV_1                  (uint32_t)(RCM_CFG_MCO1PSC|0x00000000U)                       /*!< MCO1 not divided */
#define DDL_RCM_MCO1_DIV_2                  (uint32_t)(RCM_CFG_MCO1PSC|(RCM_CFG_MCO1PSC_2 >> 16U))        /*!< MCO1 divided by 2 */
#define DDL_RCM_MCO1_DIV_3                  (uint32_t)(RCM_CFG_MCO1PSC|((RCM_CFG_MCO1PSC_2|RCM_CFG_MCO1PSC_0) >> 16U))       /*!< MCO1 divided by 3 */
#define DDL_RCM_MCO1_DIV_4                  (uint32_t)(RCM_CFG_MCO1PSC|((RCM_CFG_MCO1PSC_2|RCM_CFG_MCO1PSC_1) >> 16U))       /*!< MCO1 divided by 4 */
#define DDL_RCM_MCO1_DIV_5                  (uint32_t)(RCM_CFG_MCO1PSC|(RCM_CFG_MCO1PSC >> 16U))          /*!< MCO1 divided by 5 */
#endif /* RCM_CFG_MCO1PSC */
#if defined(RCM_CFG_MCO2PSC)
#define DDL_RCM_MCO2_DIV_1                  (uint32_t)(RCM_CFG_MCO2PSC|0x00000000U)                       /*!< MCO2 not divided */
#define DDL_RCM_MCO2_DIV_2                  (uint32_t)(RCM_CFG_MCO2PSC|(RCM_CFG_MCO2PSC_2 >> 16U))        /*!< MCO2 divided by 2 */
#define DDL_RCM_MCO2_DIV_3                  (uint32_t)(RCM_CFG_MCO2PSC|((RCM_CFG_MCO2PSC_2|RCM_CFG_MCO2PSC_0) >> 16U))       /*!< MCO2 divided by 3 */
#define DDL_RCM_MCO2_DIV_4                  (uint32_t)(RCM_CFG_MCO2PSC|((RCM_CFG_MCO2PSC_2|RCM_CFG_MCO2PSC_1) >> 16U))       /*!< MCO2 divided by 4 */
#define DDL_RCM_MCO2_DIV_5                  (uint32_t)(RCM_CFG_MCO2PSC|(RCM_CFG_MCO2PSC >> 16U))          /*!< MCO2 divided by 5 */
#endif /* RCM_CFG_MCO2PSC */
/**
  * @}
  */

#if defined(RCM_CFG_RTCPSC)
/** @defgroup RCM_DDL_EC_RTC_HSEDIV  HSE prescaler for RTC clock
  * @{
  */
#define DDL_RCM_RTC_NOCLOCK                  0x00000000U            /*!< HSE not divided */
#define DDL_RCM_RTC_HSE_DIV_2                RCM_CFG_RTCPSC_1       /*!< HSE clock divided by 2 */
#define DDL_RCM_RTC_HSE_DIV_3                (RCM_CFG_RTCPSC_1|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 3 */
#define DDL_RCM_RTC_HSE_DIV_4                RCM_CFG_RTCPSC_2       /*!< HSE clock divided by 4 */
#define DDL_RCM_RTC_HSE_DIV_5                (RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 5 */
#define DDL_RCM_RTC_HSE_DIV_6                (RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_1)       /*!< HSE clock divided by 6 */
#define DDL_RCM_RTC_HSE_DIV_7                (RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_1|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 7 */
#define DDL_RCM_RTC_HSE_DIV_8                RCM_CFG_RTCPSC_3       /*!< HSE clock divided by 8 */
#define DDL_RCM_RTC_HSE_DIV_9                (RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 9 */
#define DDL_RCM_RTC_HSE_DIV_10               (RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_1)       /*!< HSE clock divided by 10 */
#define DDL_RCM_RTC_HSE_DIV_11               (RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_1|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 11 */
#define DDL_RCM_RTC_HSE_DIV_12               (RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_2)       /*!< HSE clock divided by 12 */
#define DDL_RCM_RTC_HSE_DIV_13               (RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 13 */
#define DDL_RCM_RTC_HSE_DIV_14               (RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_1)       /*!< HSE clock divided by 14 */
#define DDL_RCM_RTC_HSE_DIV_15               (RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_1|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 15 */
#define DDL_RCM_RTC_HSE_DIV_16               RCM_CFG_RTCPSC_4       /*!< HSE clock divided by 16 */
#define DDL_RCM_RTC_HSE_DIV_17               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 17 */
#define DDL_RCM_RTC_HSE_DIV_18               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_1)       /*!< HSE clock divided by 18 */
#define DDL_RCM_RTC_HSE_DIV_19               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_1|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 19 */
#define DDL_RCM_RTC_HSE_DIV_20               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_2)       /*!< HSE clock divided by 20 */
#define DDL_RCM_RTC_HSE_DIV_21               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 21 */
#define DDL_RCM_RTC_HSE_DIV_22               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_1)       /*!< HSE clock divided by 22 */
#define DDL_RCM_RTC_HSE_DIV_23               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_1|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 23 */
#define DDL_RCM_RTC_HSE_DIV_24               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_3)       /*!< HSE clock divided by 24 */
#define DDL_RCM_RTC_HSE_DIV_25               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 25 */
#define DDL_RCM_RTC_HSE_DIV_26               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_1)       /*!< HSE clock divided by 26 */
#define DDL_RCM_RTC_HSE_DIV_27               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_1|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 27 */
#define DDL_RCM_RTC_HSE_DIV_28               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_2)       /*!< HSE clock divided by 28 */
#define DDL_RCM_RTC_HSE_DIV_29               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 29 */
#define DDL_RCM_RTC_HSE_DIV_30               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_1)       /*!< HSE clock divided by 30 */
#define DDL_RCM_RTC_HSE_DIV_31               (RCM_CFG_RTCPSC_4|RCM_CFG_RTCPSC_3|RCM_CFG_RTCPSC_2|RCM_CFG_RTCPSC_1|RCM_CFG_RTCPSC_0)       /*!< HSE clock divided by 31 */
/**
  * @}
  */
#endif /* RCM_CFG_RTCPSC */

#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup RCM_DDL_EC_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define DDL_RCM_PERIPH_FREQUENCY_NO         0x00000000U                 /*!< No clock enabled for the peripheral            */
#define DDL_RCM_PERIPH_FREQUENCY_NA         0xFFFFFFFFU                 /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/** @defgroup RCM_DDL_EC_I2S1_CLKSOURCE  Peripheral I2S clock source selection
  * @{
  */
#if defined(RCM_CFG_I2SSEL)
#define DDL_RCM_I2S1_CLKSOURCE_PLLI2S     0x00000000U               /*!< I2S oscillator clock used as I2S1 clock */
#define DDL_RCM_I2S1_CLKSOURCE_PIN        RCM_CFG_I2SSEL            /*!< External pin clock used as I2S1 clock */
#endif /* RCM_CFG_I2SSEL */
/**
  * @}
  */

#if defined(SDIO)
/** @defgroup RCM_DDL_EC_SDIOx  Peripheral SDIO get clock source
  * @{
  */
#define DDL_RCM_SDIO_CLKSOURCE            RCM_PLL1CFG_PLLD      /*!< SDIO Clock source selection */
/**
  * @}
  */
#endif /* SDIO */

#if defined(RNG)
/** @defgroup RCM_DDL_EC_RNG  Peripheral RNG get clock source
  * @{
  */
#define DDL_RCM_RNG_CLKSOURCE               RCM_PLL1CFG_PLLD       /*!< RNG Clock source selection */
/**
  * @}
  */
#endif /* RNG */

#if defined(RCM_CFG_ADCPSC)
/** @defgroup RCM_DDL_EC_ADC_CLKSOURCE_PCLK2 Peripheral ADC clock source selection
  * @{
  */
#define DDL_RCM_ADC_CLKSRC_PCLK2_DIV_2      RCM_CFG_ADCPSC_DIV2    /*!< PCLK2 divided by 2 selected as ADC Clock source */
#define DDL_RCM_ADC_CLKSRC_PCLK2_DIV_4      RCM_CFG_ADCPSC_DIV4    /*!< PCLK2 divided by 4 selected as ADC Clock source */
#define DDL_RCM_ADC_CLKSRC_PCLK2_DIV_6      RCM_CFG_ADCPSC_DIV6    /*!< PCLK2 divided by 6 selected as ADC Clock source */
#define DDL_RCM_ADC_CLKSRC_PCLK2_DIV_8      RCM_CFG_ADCPSC_DIV8    /*!< PCLK2 divided by 8 selected as ADC Clock source */
/**
  * @}
  */

