betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rcm.h
 /** @defgroup RCM_DDL_EC_ADC Peripheral ADC get clock source
  * @{
  */
#define DDL_RCM_ADC_CLKSOURCE               RCM_CFG_ADCPSC         /*!< ADC Clock source selection */
/**
  * @}
  */
#endif /* RCM_CFG_ADCPSC */

#if defined(USB_OTG_FS) || defined(USB_OTG_HS) || defined(USB_OTG_FS2)
/** @defgroup RCM_DDL_EC_USB_CLKSOURCE Peripheral USB clock source selection
  * @{
  */
#if defined(RCM_CFG_OTGFSPSC)
#define DDL_RCM_USB_CLKSOURCE_PLL_DIV_1_5     RCM_CFG_OTGFSPSC_DIV_1_5  /*!< PLL clock divided by 1.5 selected as USB Clock source */
#define DDL_RCM_USB_CLKSOURCE_PLL             RCM_CFG_OTGFSPSC_0        /*!< PLL clock selected as USB Clock source */
#define DDL_RCM_USB_CLKSOURCE_PLL_DIV_2       RCM_CFG_OTGFSPSC_1        /*!< PLL clock divided by 2 selected as USB Clock source */
#define DDL_RCM_USB_CLKSOURCE_PLL_DIV_2_5     RCM_CFG_OTGFSPSC          /*!< PLL clock divided by 2.5 selected as USB Clock source */
#endif /* RCM_CFG_OTGFSPSC */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_USB  Peripheral USB get clock source
  * @{
  */
#if defined(RCM_CFG_OTGFSPSC)
#define DDL_RCM_USB_CLKSOURCE               RCM_CFG_OTGFSPSC       /*!< USB Clock source selection */
#else
#define DDL_RCM_USB_CLKSOURCE               RCM_PLL1CFG_PLLD       /*!< USB Clock source selection */
#endif /* RCM_CFG_OTGFSPSC */
/**
  * @}
  */
#endif /* USB_OTG_FS || USB_OTG_HS || USB_OTG_FS2 */


/** @defgroup RCM_DDL_EC_I2S1  Peripheral I2S get clock source
  * @{
  */
#if defined(RCM_CFG_I2SSEL)
#define DDL_RCM_I2S1_CLKSOURCE              RCM_CFG_I2SSEL     /*!< I2S1 Clock source selection */
#endif /* RCM_CFG_I2SSEL */
/**
  * @}
  */


/** @defgroup RCM_DDL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define DDL_RCM_RTC_CLKSOURCE_NONE          0x00000000U                  /*!< No clock used as RTC clock */
#define DDL_RCM_RTC_CLKSOURCE_LSE           RCM_BDCTRL_RTCSRCSEL_0       /*!< LSE oscillator clock used as RTC clock */
#define DDL_RCM_RTC_CLKSOURCE_LSI           RCM_BDCTRL_RTCSRCSEL_1       /*!< LSI oscillator clock used as RTC clock */
#define DDL_RCM_RTC_CLKSOURCE_HSE           RCM_BDCTRL_RTCSRCSEL         /*!< HSE oscillator clock divided by HSE prescaler used as RTC clock */
/**
  * @}
  */

#if defined(RCM_CFGSEL_CLKPSEL)
/** @defgroup RCM_DDL_EC_TMR_CLKPRESCALER  Timers clocks prescalers selection
  * @{
  */
#define DDL_RCM_TMR_PRESCALER_TWICE          0x00000000U                  /*!< Timers clock to twice PCLK */
#define DDL_RCM_TMR_PRESCALER_FOUR_TIMES     RCM_CFGSEL_CLKPSEL           /*!< Timers clock to four time PCLK */
/**
  * @}
  */
#endif /* RCM_CFGSEL_CLKPSEL */

/** @defgroup RCM_DDL_EC_PLLSOURCE  PLL, PLLI2S and PLLSAI entry clock source
  * @{
  */
#if defined(RCM_PLL1CFG_PLL1CLKS_HSI)
#define DDL_RCM_PLLSOURCE_HSI               RCM_PLL1CFG_PLL1CLKS_HSI  /*!< HSI16 clock selected as PLL entry clock source */
#endif /* RCM_PLL1CFG_PLL1CLKS_HSI */
#if defined(RCM_CFG_PLLSRCSEL)
#define DDL_RCM_PLLSOURCE_HSI_DIV_2         0x00000000U               /*!< HSI divided by 2 clock selected as PLL entry clock source */
#endif /* RCM_CFG_PLLSRCSEL */
#if defined(RCM_PLL1CFG_PLL1CLKS_HSE)
#define DDL_RCM_PLLSOURCE_HSE               RCM_PLL1CFG_PLL1CLKS_HSE  /*!< HSE clock selected as PLL entry clock source */
#else
#define DDL_RCM_PLLSOURCE_HSE               RCM_CFG_PLLSRCSEL         /*!< HSE clock selected as PLL entry clock source */
#define DDL_RCM_PLLSOURCE_HSE_DIV_2         (RCM_CFG_PLLSRCSEL | RCM_CFG_PLLHSEPSC_HSE_DIV2)         /*!< HSE clock selected as PLL entry clock source */
#endif /* RCM_PLL1CFG_PLL1CLKS_HSE */
/**
  * @}
  */

#if defined(APM32F403xx) || defined(APM32F402xx)
/** @defgroup RCM_DDL_EC_PREDIV_DIV PREDIV Division factor
  * @{
  */
#define DDL_RCM_PREDIV_DIV_1                0x00000000U               /*!< HSE divider clock not divided */
#define DDL_RCM_PREDIV_DIV_2                RCM_CFG_PLLHSEPSC         /*!< HSE divider clock divided by 2 */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_PLL_MUL PLL Multiplicator factor
  * @{
  */
#define DDL_RCM_PLL_MUL_2                   RCM_CFG_PLLMULCFG2   /*!< PLL input clock*2 */
#define DDL_RCM_PLL_MUL_3                   RCM_CFG_PLLMULCFG3   /*!< PLL input clock*3 */
#define DDL_RCM_PLL_MUL_4                   RCM_CFG_PLLMULCFG4   /*!< PLL input clock*4 */
#define DDL_RCM_PLL_MUL_5                   RCM_CFG_PLLMULCFG5   /*!< PLL input clock*5 */
#define DDL_RCM_PLL_MUL_6                   RCM_CFG_PLLMULCFG6   /*!< PLL input clock*6 */
#define DDL_RCM_PLL_MUL_7                   RCM_CFG_PLLMULCFG7   /*!< PLL input clock*7 */
#define DDL_RCM_PLL_MUL_8                   RCM_CFG_PLLMULCFG8   /*!< PLL input clock*8 */
#define DDL_RCM_PLL_MUL_9                   RCM_CFG_PLLMULCFG9   /*!< PLL input clock*9 */
#define DDL_RCM_PLL_MUL_10                  RCM_CFG_PLLMULCFG10  /*!< PLL input clock*10 */
#define DDL_RCM_PLL_MUL_11                  RCM_CFG_PLLMULCFG11  /*!< PLL input clock*11 */
#define DDL_RCM_PLL_MUL_12                  RCM_CFG_PLLMULCFG12  /*!< PLL input clock*12 */
#define DDL_RCM_PLL_MUL_13                  RCM_CFG_PLLMULCFG13  /*!< PLL input clock*13 */
#define DDL_RCM_PLL_MUL_14                  RCM_CFG_PLLMULCFG14  /*!< PLL input clock*14 */
#define DDL_RCM_PLL_MUL_15                  RCM_CFG_PLLMULCFG15  /*!< PLL input clock*15 */
#define DDL_RCM_PLL_MUL_16                  RCM_CFG_PLLMULCFG16  /*!< PLL input clock*16 */
/**
  * @}
  */
#else
/** @defgroup RCM_DDL_EC_PLLB_DIV  PLL, PLLI2S and PLLSAI division factor
  * @{
  */
#define DDL_RCM_PLLB_DIV_2                  (RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 2 */
#define DDL_RCM_PLLB_DIV_3                  (RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 3 */
#define DDL_RCM_PLLB_DIV_4                  (RCM_PLL1CFG_PLLB_2) /*!< PLL, PLLI2S and PLLSAI division factor by 4 */
#define DDL_RCM_PLLB_DIV_5                  (RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 5 */
#define DDL_RCM_PLLB_DIV_6                  (RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 6 */
#define DDL_RCM_PLLB_DIV_7                  (RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 7 */
#define DDL_RCM_PLLB_DIV_8                  (RCM_PLL1CFG_PLLB_3) /*!< PLL, PLLI2S and PLLSAI division factor by 8 */
#define DDL_RCM_PLLB_DIV_9                  (RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 9 */
#define DDL_RCM_PLLB_DIV_10                 (RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 10 */
#define DDL_RCM_PLLB_DIV_11                 (RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 11 */
#define DDL_RCM_PLLB_DIV_12                 (RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2) /*!< PLL, PLLI2S and PLLSAI division factor by 12 */
#define DDL_RCM_PLLB_DIV_13                 (RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 13 */
#define DDL_RCM_PLLB_DIV_14                 (RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 14 */
#define DDL_RCM_PLLB_DIV_15                 (RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 15 */
#define DDL_RCM_PLLB_DIV_16                 (RCM_PLL1CFG_PLLB_4) /*!< PLL, PLLI2S and PLLSAI division factor by 16 */
#define DDL_RCM_PLLB_DIV_17                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 17 */
#define DDL_RCM_PLLB_DIV_18                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 18 */
#define DDL_RCM_PLLB_DIV_19                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 19 */
#define DDL_RCM_PLLB_DIV_20                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_2) /*!< PLL, PLLI2S and PLLSAI division factor by 20 */
#define DDL_RCM_PLLB_DIV_21                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 21 */
#define DDL_RCM_PLLB_DIV_22                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 22 */
#define DDL_RCM_PLLB_DIV_23                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 23 */
#define DDL_RCM_PLLB_DIV_24                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3) /*!< PLL, PLLI2S and PLLSAI division factor by 24 */
#define DDL_RCM_PLLB_DIV_25                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 25 */
#define DDL_RCM_PLLB_DIV_26                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 26 */
#define DDL_RCM_PLLB_DIV_27                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 27 */
#define DDL_RCM_PLLB_DIV_28                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2) /*!< PLL, PLLI2S and PLLSAI division factor by 28 */
#define DDL_RCM_PLLB_DIV_29                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 29 */
#define DDL_RCM_PLLB_DIV_30                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 30 */
#define DDL_RCM_PLLB_DIV_31                 (RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 31 */
#define DDL_RCM_PLLB_DIV_32                 (RCM_PLL1CFG_PLLB_5) /*!< PLL, PLLI2S and PLLSAI division factor by 32 */
#define DDL_RCM_PLLB_DIV_33                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 33 */
#define DDL_RCM_PLLB_DIV_34                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 34 */
#define DDL_RCM_PLLB_DIV_35                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 35 */
#define DDL_RCM_PLLB_DIV_36                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_2) /*!< PLL, PLLI2S and PLLSAI division factor by 36 */
#define DDL_RCM_PLLB_DIV_37                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 37 */
#define DDL_RCM_PLLB_DIV_38                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 38 */
#define DDL_RCM_PLLB_DIV_39                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 39 */
#define DDL_RCM_PLLB_DIV_40                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_3) /*!< PLL, PLLI2S and PLLSAI division factor by 40 */
#define DDL_RCM_PLLB_DIV_41                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 41 */
#define DDL_RCM_PLLB_DIV_42                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 42 */
#define DDL_RCM_PLLB_DIV_43                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 43 */
#define DDL_RCM_PLLB_DIV_44                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2) /*!< PLL, PLLI2S and PLLSAI division factor by 44 */
#define DDL_RCM_PLLB_DIV_45                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 45 */
#define DDL_RCM_PLLB_DIV_46                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 46 */
#define DDL_RCM_PLLB_DIV_47                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 47 */
#define DDL_RCM_PLLB_DIV_48                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4) /*!< PLL, PLLI2S and PLLSAI division factor by 48 */
#define DDL_RCM_PLLB_DIV_49                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 49 */
#define DDL_RCM_PLLB_DIV_50                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 50 */
#define DDL_RCM_PLLB_DIV_51                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 51 */
#define DDL_RCM_PLLB_DIV_52                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_2) /*!< PLL, PLLI2S and PLLSAI division factor by 52 */
#define DDL_RCM_PLLB_DIV_53                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 53 */
#define DDL_RCM_PLLB_DIV_54                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 54 */
#define DDL_RCM_PLLB_DIV_55                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 55 */
#define DDL_RCM_PLLB_DIV_56                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3) /*!< PLL, PLLI2S and PLLSAI division factor by 56 */
#define DDL_RCM_PLLB_DIV_57                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 57 */
#define DDL_RCM_PLLB_DIV_58                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 58 */
#define DDL_RCM_PLLB_DIV_59                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 59 */
#define DDL_RCM_PLLB_DIV_60                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2) /*!< PLL, PLLI2S and PLLSAI division factor by 60 */
#define DDL_RCM_PLLB_DIV_61                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 61 */
#define DDL_RCM_PLLB_DIV_62                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1) /*!< PLL, PLLI2S and PLLSAI division factor by 62 */
#define DDL_RCM_PLLB_DIV_63                 (RCM_PLL1CFG_PLLB_5 | RCM_PLL1CFG_PLLB_4 | RCM_PLL1CFG_PLLB_3 | RCM_PLL1CFG_PLLB_2 | RCM_PLL1CFG_PLLB_1 | RCM_PLL1CFG_PLLB_0) /*!< PLL, PLLI2S and PLLSAI division factor by 63 */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_PLL1C_DIV  PLL division factor (PLL1C)
  * @{
  */
#define DDL_RCM_PLL1C_DIV_2                  0x00000000U             /*!< Main PLL division factor for PLL1C output by 2 */
#define DDL_RCM_PLL1C_DIV_4                  RCM_PLL1CFG_PLL1C_0     /*!< Main PLL division factor for PLL1C output by 4 */
#define DDL_RCM_PLL1C_DIV_6                  RCM_PLL1CFG_PLL1C_1     /*!< Main PLL division factor for PLL1C output by 6 */
#define DDL_RCM_PLL1C_DIV_8                  (RCM_PLL1CFG_PLL1C_1 | RCM_PLL1CFG_PLL1C_0)   /*!< Main PLL division factor for PLL1C output by 8 */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_PLLD_DIV  PLL division factor (PLLD)
  * @{
  */
#define DDL_RCM_PLLD_DIV_2                  RCM_PLL1CFG_PLLD_1                      /*!< Main PLL division factor for PLLD output by 2 */
#define DDL_RCM_PLLD_DIV_3                  (RCM_PLL1CFG_PLLD_1|RCM_PLL1CFG_PLLD_0) /*!< Main PLL division factor for PLLD output by 3 */
#define DDL_RCM_PLLD_DIV_4                  RCM_PLL1CFG_PLLD_2                      /*!< Main PLL division factor for PLLD output by 4 */
#define DDL_RCM_PLLD_DIV_5                  (RCM_PLL1CFG_PLLD_2|RCM_PLL1CFG_PLLD_0) /*!< Main PLL division factor for PLLD output by 5 */
#define DDL_RCM_PLLD_DIV_6                  (RCM_PLL1CFG_PLLD_2|RCM_PLL1CFG_PLLD_1) /*!< Main PLL division factor for PLLD output by 6 */
#define DDL_RCM_PLLD_DIV_7                  (RCM_PLL1CFG_PLLD_2|RCM_PLL1CFG_PLLD_1|RCM_PLL1CFG_PLLD_0) /*!< Main PLL division factor for PLLD output by 7 */
#define DDL_RCM_PLLD_DIV_8                  RCM_PLL1CFG_PLLD_3                      /*!< Main PLL division factor for PLLD output by 8 */
#define DDL_RCM_PLLD_DIV_9                  (RCM_PLL1CFG_PLLD_3|RCM_PLL1CFG_PLLD_0) /*!< Main PLL division factor for PLLD output by 9 */
#define DDL_RCM_PLLD_DIV_10                 (RCM_PLL1CFG_PLLD_3|RCM_PLL1CFG_PLLD_1) /*!< Main PLL division factor for PLLD output by 10 */
#define DDL_RCM_PLLD_DIV_11                 (RCM_PLL1CFG_PLLD_3|RCM_PLL1CFG_PLLD_1|RCM_PLL1CFG_PLLD_0) /*!< Main PLL division factor for PLLD output by 11 */
#define DDL_RCM_PLLD_DIV_12                 (RCM_PLL1CFG_PLLD_3|RCM_PLL1CFG_PLLD_2) /*!< Main PLL division factor for PLLD output by 12 */
#define DDL_RCM_PLLD_DIV_13                 (RCM_PLL1CFG_PLLD_3|RCM_PLL1CFG_PLLD_2|RCM_PLL1CFG_PLLD_0) /*!< Main PLL division factor for PLLD output by 13 */
#define DDL_RCM_PLLD_DIV_14                 (RCM_PLL1CFG_PLLD_3|RCM_PLL1CFG_PLLD_2|RCM_PLL1CFG_PLLD_1) /*!< Main PLL division factor for PLLD output by 14 */
#define DDL_RCM_PLLD_DIV_15                 (RCM_PLL1CFG_PLLD_3|RCM_PLL1CFG_PLLD_2|RCM_PLL1CFG_PLLD_1|RCM_PLL1CFG_PLLD_0) /*!< Main PLL division factor for PLLD output by 15 */
/**
  * @}
  */
#endif /* APM32F403xx || APM32F402xx */

#if defined(RCM_SSCCFG_SSSEL)
/** @defgroup RCM_DDL_EC_PLL_SPRE_SEL  PLL Spread Spectrum Selection
  * @{
  */
#define DDL_RCM_SPREAD_SELECT_CENTER        0x00000000U                /*!< PLL center spread spectrum selection */
#define DDL_RCM_SPREAD_SELECT_DOWN          RCM_SSCCFG_SSSEL           /*!< PLL down spread spectrum selection */
/**
  * @}
  */
#endif /* RCM_SSCCFG_SSSEL */

