betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rcm.h
#if defined(RCM_PLLI2S_SUPPORT)
/** @defgroup RCM_DDL_EC_PLL2B  PLL2B division factor (PLL2B)
  * @{
  */
#if defined(RCM_PLL2CFG_PLL2B)
#define DDL_RCM_PLL2B_DIV_2             (RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 2 */
#define DDL_RCM_PLL2B_DIV_3             (RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 3 */
#define DDL_RCM_PLL2B_DIV_4             (RCM_PLL2CFG_PLL2B_2) /*!< PLLI2S division factor for PLL2B output by 4 */
#define DDL_RCM_PLL2B_DIV_5             (RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 5 */
#define DDL_RCM_PLL2B_DIV_6             (RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 6 */
#define DDL_RCM_PLL2B_DIV_7             (RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 7 */
#define DDL_RCM_PLL2B_DIV_8             (RCM_PLL2CFG_PLL2B_3) /*!< PLLI2S division factor for PLL2B output by 8 */
#define DDL_RCM_PLL2B_DIV_9             (RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 9 */
#define DDL_RCM_PLL2B_DIV_10            (RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 10 */
#define DDL_RCM_PLL2B_DIV_11            (RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 11 */
#define DDL_RCM_PLL2B_DIV_12            (RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2) /*!< PLLI2S division factor for PLL2B output by 12 */
#define DDL_RCM_PLL2B_DIV_13            (RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 13 */
#define DDL_RCM_PLL2B_DIV_14            (RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 14 */
#define DDL_RCM_PLL2B_DIV_15            (RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 15 */
#define DDL_RCM_PLL2B_DIV_16            (RCM_PLL2CFG_PLL2B_4) /*!< PLLI2S division factor for PLL2B output by 16 */
#define DDL_RCM_PLL2B_DIV_17            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 17 */
#define DDL_RCM_PLL2B_DIV_18            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 18 */
#define DDL_RCM_PLL2B_DIV_19            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 19 */
#define DDL_RCM_PLL2B_DIV_20            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_2) /*!< PLLI2S division factor for PLL2B output by 20 */
#define DDL_RCM_PLL2B_DIV_21            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 21 */
#define DDL_RCM_PLL2B_DIV_22            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 22 */
#define DDL_RCM_PLL2B_DIV_23            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 23 */
#define DDL_RCM_PLL2B_DIV_24            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3) /*!< PLLI2S division factor for PLL2B output by 24 */
#define DDL_RCM_PLL2B_DIV_25            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 25 */
#define DDL_RCM_PLL2B_DIV_26            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 26 */
#define DDL_RCM_PLL2B_DIV_27            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 27 */
#define DDL_RCM_PLL2B_DIV_28            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2) /*!< PLLI2S division factor for PLL2B output by 28 */
#define DDL_RCM_PLL2B_DIV_29            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 29 */
#define DDL_RCM_PLL2B_DIV_30            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 30 */
#define DDL_RCM_PLL2B_DIV_31            (RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 31 */
#define DDL_RCM_PLL2B_DIV_32            (RCM_PLL2CFG_PLL2B_5) /*!< PLLI2S division factor for PLL2B output by 32 */
#define DDL_RCM_PLL2B_DIV_33            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 33 */
#define DDL_RCM_PLL2B_DIV_34            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 34 */
#define DDL_RCM_PLL2B_DIV_35            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 35 */
#define DDL_RCM_PLL2B_DIV_36            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_2) /*!< PLLI2S division factor for PLL2B output by 36 */
#define DDL_RCM_PLL2B_DIV_37            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 37 */
#define DDL_RCM_PLL2B_DIV_38            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 38 */
#define DDL_RCM_PLL2B_DIV_39            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 39 */
#define DDL_RCM_PLL2B_DIV_40            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_3) /*!< PLLI2S division factor for PLL2B output by 40 */
#define DDL_RCM_PLL2B_DIV_41            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 41 */
#define DDL_RCM_PLL2B_DIV_42            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 42 */
#define DDL_RCM_PLL2B_DIV_43            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 43 */
#define DDL_RCM_PLL2B_DIV_44            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2) /*!< PLLI2S division factor for PLL2B output by 44 */
#define DDL_RCM_PLL2B_DIV_45            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 45 */
#define DDL_RCM_PLL2B_DIV_46            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 46 */
#define DDL_RCM_PLL2B_DIV_47            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 47 */
#define DDL_RCM_PLL2B_DIV_48            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4) /*!< PLLI2S division factor for PLL2B output by 48 */
#define DDL_RCM_PLL2B_DIV_49            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 49 */
#define DDL_RCM_PLL2B_DIV_50            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 50 */
#define DDL_RCM_PLL2B_DIV_51            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 51 */
#define DDL_RCM_PLL2B_DIV_52            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_2) /*!< PLLI2S division factor for PLL2B output by 52 */
#define DDL_RCM_PLL2B_DIV_53            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 53 */
#define DDL_RCM_PLL2B_DIV_54            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 54 */
#define DDL_RCM_PLL2B_DIV_55            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 55 */
#define DDL_RCM_PLL2B_DIV_56            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3) /*!< PLLI2S division factor for PLL2B output by 56 */
#define DDL_RCM_PLL2B_DIV_57            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 57 */
#define DDL_RCM_PLL2B_DIV_58            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 58 */
#define DDL_RCM_PLL2B_DIV_59            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 59 */
#define DDL_RCM_PLL2B_DIV_60            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2) /*!< PLLI2S division factor for PLL2B output by 60 */
#define DDL_RCM_PLL2B_DIV_61            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 61 */
#define DDL_RCM_PLL2B_DIV_62            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1) /*!< PLLI2S division factor for PLL2B output by 62 */
#define DDL_RCM_PLL2B_DIV_63            (RCM_PLL2CFG_PLL2B_5 | RCM_PLL2CFG_PLL2B_4 | RCM_PLL2CFG_PLL2B_3 | RCM_PLL2CFG_PLL2B_2 | RCM_PLL2CFG_PLL2B_1 | RCM_PLL2CFG_PLL2B_0) /*!< PLLI2S division factor for PLL2B output by 63 */
#else
#define DDL_RCM_PLL2B_DIV_2              DDL_RCM_PLLB_DIV_2      /*!< PLLI2S division factor for PLL2B output by 2 */
#define DDL_RCM_PLL2B_DIV_3              DDL_RCM_PLLB_DIV_3      /*!< PLLI2S division factor for PLL2B output by 3 */
#define DDL_RCM_PLL2B_DIV_4              DDL_RCM_PLLB_DIV_4      /*!< PLLI2S division factor for PLL2B output by 4 */
#define DDL_RCM_PLL2B_DIV_5              DDL_RCM_PLLB_DIV_5      /*!< PLLI2S division factor for PLL2B output by 5 */
#define DDL_RCM_PLL2B_DIV_6              DDL_RCM_PLLB_DIV_6      /*!< PLLI2S division factor for PLL2B output by 6 */
#define DDL_RCM_PLL2B_DIV_7              DDL_RCM_PLLB_DIV_7      /*!< PLLI2S division factor for PLL2B output by 7 */
#define DDL_RCM_PLL2B_DIV_8              DDL_RCM_PLLB_DIV_8      /*!< PLLI2S division factor for PLL2B output by 8 */
#define DDL_RCM_PLL2B_DIV_9              DDL_RCM_PLLB_DIV_9      /*!< PLLI2S division factor for PLL2B output by 9 */
#define DDL_RCM_PLL2B_DIV_10             DDL_RCM_PLLB_DIV_10     /*!< PLLI2S division factor for PLL2B output by 10 */
#define DDL_RCM_PLL2B_DIV_11             DDL_RCM_PLLB_DIV_11     /*!< PLLI2S division factor for PLL2B output by 11 */
#define DDL_RCM_PLL2B_DIV_12             DDL_RCM_PLLB_DIV_12     /*!< PLLI2S division factor for PLL2B output by 12 */
#define DDL_RCM_PLL2B_DIV_13             DDL_RCM_PLLB_DIV_13     /*!< PLLI2S division factor for PLL2B output by 13 */
#define DDL_RCM_PLL2B_DIV_14             DDL_RCM_PLLB_DIV_14     /*!< PLLI2S division factor for PLL2B output by 14 */
#define DDL_RCM_PLL2B_DIV_15             DDL_RCM_PLLB_DIV_15     /*!< PLLI2S division factor for PLL2B output by 15 */
#define DDL_RCM_PLL2B_DIV_16             DDL_RCM_PLLB_DIV_16     /*!< PLLI2S division factor for PLL2B output by 16 */
#define DDL_RCM_PLL2B_DIV_17             DDL_RCM_PLLB_DIV_17     /*!< PLLI2S division factor for PLL2B output by 17 */
#define DDL_RCM_PLL2B_DIV_18             DDL_RCM_PLLB_DIV_18     /*!< PLLI2S division factor for PLL2B output by 18 */
#define DDL_RCM_PLL2B_DIV_19             DDL_RCM_PLLB_DIV_19     /*!< PLLI2S division factor for PLL2B output by 19 */
#define DDL_RCM_PLL2B_DIV_20             DDL_RCM_PLLB_DIV_20     /*!< PLLI2S division factor for PLL2B output by 20 */
#define DDL_RCM_PLL2B_DIV_21             DDL_RCM_PLLB_DIV_21     /*!< PLLI2S division factor for PLL2B output by 21 */
#define DDL_RCM_PLL2B_DIV_22             DDL_RCM_PLLB_DIV_22     /*!< PLLI2S division factor for PLL2B output by 22 */
#define DDL_RCM_PLL2B_DIV_23             DDL_RCM_PLLB_DIV_23     /*!< PLLI2S division factor for PLL2B output by 23 */
#define DDL_RCM_PLL2B_DIV_24             DDL_RCM_PLLB_DIV_24     /*!< PLLI2S division factor for PLL2B output by 24 */
#define DDL_RCM_PLL2B_DIV_25             DDL_RCM_PLLB_DIV_25     /*!< PLLI2S division factor for PLL2B output by 25 */
#define DDL_RCM_PLL2B_DIV_26             DDL_RCM_PLLB_DIV_26     /*!< PLLI2S division factor for PLL2B output by 26 */
#define DDL_RCM_PLL2B_DIV_27             DDL_RCM_PLLB_DIV_27     /*!< PLLI2S division factor for PLL2B output by 27 */
#define DDL_RCM_PLL2B_DIV_28             DDL_RCM_PLLB_DIV_28     /*!< PLLI2S division factor for PLL2B output by 28 */
#define DDL_RCM_PLL2B_DIV_29             DDL_RCM_PLLB_DIV_29     /*!< PLLI2S division factor for PLL2B output by 29 */
#define DDL_RCM_PLL2B_DIV_30             DDL_RCM_PLLB_DIV_30     /*!< PLLI2S division factor for PLL2B output by 30 */
#define DDL_RCM_PLL2B_DIV_31             DDL_RCM_PLLB_DIV_31     /*!< PLLI2S division factor for PLL2B output by 31 */
#define DDL_RCM_PLL2B_DIV_32             DDL_RCM_PLLB_DIV_32     /*!< PLLI2S division factor for PLL2B output by 32 */
#define DDL_RCM_PLL2B_DIV_33             DDL_RCM_PLLB_DIV_33     /*!< PLLI2S division factor for PLL2B output by 33 */
#define DDL_RCM_PLL2B_DIV_34             DDL_RCM_PLLB_DIV_34     /*!< PLLI2S division factor for PLL2B output by 34 */
#define DDL_RCM_PLL2B_DIV_35             DDL_RCM_PLLB_DIV_35     /*!< PLLI2S division factor for PLL2B output by 35 */
#define DDL_RCM_PLL2B_DIV_36             DDL_RCM_PLLB_DIV_36     /*!< PLLI2S division factor for PLL2B output by 36 */
#define DDL_RCM_PLL2B_DIV_37             DDL_RCM_PLLB_DIV_37     /*!< PLLI2S division factor for PLL2B output by 37 */
#define DDL_RCM_PLL2B_DIV_38             DDL_RCM_PLLB_DIV_38     /*!< PLLI2S division factor for PLL2B output by 38 */
#define DDL_RCM_PLL2B_DIV_39             DDL_RCM_PLLB_DIV_39     /*!< PLLI2S division factor for PLL2B output by 39 */
#define DDL_RCM_PLL2B_DIV_40             DDL_RCM_PLLB_DIV_40     /*!< PLLI2S division factor for PLL2B output by 40 */
#define DDL_RCM_PLL2B_DIV_41             DDL_RCM_PLLB_DIV_41     /*!< PLLI2S division factor for PLL2B output by 41 */
#define DDL_RCM_PLL2B_DIV_42             DDL_RCM_PLLB_DIV_42     /*!< PLLI2S division factor for PLL2B output by 42 */
#define DDL_RCM_PLL2B_DIV_43             DDL_RCM_PLLB_DIV_43     /*!< PLLI2S division factor for PLL2B output by 43 */
#define DDL_RCM_PLL2B_DIV_44             DDL_RCM_PLLB_DIV_44     /*!< PLLI2S division factor for PLL2B output by 44 */
#define DDL_RCM_PLL2B_DIV_45             DDL_RCM_PLLB_DIV_45     /*!< PLLI2S division factor for PLL2B output by 45 */
#define DDL_RCM_PLL2B_DIV_46             DDL_RCM_PLLB_DIV_46     /*!< PLLI2S division factor for PLL2B output by 46 */
#define DDL_RCM_PLL2B_DIV_47             DDL_RCM_PLLB_DIV_47     /*!< PLLI2S division factor for PLL2B output by 47 */
#define DDL_RCM_PLL2B_DIV_48             DDL_RCM_PLLB_DIV_48     /*!< PLLI2S division factor for PLL2B output by 48 */
#define DDL_RCM_PLL2B_DIV_49             DDL_RCM_PLLB_DIV_49     /*!< PLLI2S division factor for PLL2B output by 49 */
#define DDL_RCM_PLL2B_DIV_50             DDL_RCM_PLLB_DIV_50     /*!< PLLI2S division factor for PLL2B output by 50 */
#define DDL_RCM_PLL2B_DIV_51             DDL_RCM_PLLB_DIV_51     /*!< PLLI2S division factor for PLL2B output by 51 */
#define DDL_RCM_PLL2B_DIV_52             DDL_RCM_PLLB_DIV_52     /*!< PLLI2S division factor for PLL2B output by 52 */
#define DDL_RCM_PLL2B_DIV_53             DDL_RCM_PLLB_DIV_53     /*!< PLLI2S division factor for PLL2B output by 53 */
#define DDL_RCM_PLL2B_DIV_54             DDL_RCM_PLLB_DIV_54     /*!< PLLI2S division factor for PLL2B output by 54 */
#define DDL_RCM_PLL2B_DIV_55             DDL_RCM_PLLB_DIV_55     /*!< PLLI2S division factor for PLL2B output by 55 */
#define DDL_RCM_PLL2B_DIV_56             DDL_RCM_PLLB_DIV_56     /*!< PLLI2S division factor for PLL2B output by 56 */
#define DDL_RCM_PLL2B_DIV_57             DDL_RCM_PLLB_DIV_57     /*!< PLLI2S division factor for PLL2B output by 57 */
#define DDL_RCM_PLL2B_DIV_58             DDL_RCM_PLLB_DIV_58     /*!< PLLI2S division factor for PLL2B output by 58 */
#define DDL_RCM_PLL2B_DIV_59             DDL_RCM_PLLB_DIV_59     /*!< PLLI2S division factor for PLL2B output by 59 */
#define DDL_RCM_PLL2B_DIV_60             DDL_RCM_PLLB_DIV_60     /*!< PLLI2S division factor for PLL2B output by 60 */
#define DDL_RCM_PLL2B_DIV_61             DDL_RCM_PLLB_DIV_61     /*!< PLLI2S division factor for PLL2B output by 61 */
#define DDL_RCM_PLL2B_DIV_62             DDL_RCM_PLLB_DIV_62     /*!< PLLI2S division factor for PLL2B output by 62 */
#define DDL_RCM_PLL2B_DIV_63             DDL_RCM_PLLB_DIV_63     /*!< PLLI2S division factor for PLL2B output by 63 */
#endif /* RCM_PLL2CFG_PLL2B */
/**
  * @}
  */

/** @defgroup RCM_DDL_EC_PLL2C  PLL2C division factor (PLL2C)
  * @{
  */
#define DDL_RCM_PLL2C_DIV_2              RCM_PLL2CFG_PLL2C_1                                /*!< PLLI2S division factor for PLL2C output by 2 */
#define DDL_RCM_PLL2C_DIV_3              (RCM_PLL2CFG_PLL2C_1 | RCM_PLL2CFG_PLL2C_0)        /*!< PLLI2S division factor for PLL2C output by 3 */
#define DDL_RCM_PLL2C_DIV_4              RCM_PLL2CFG_PLL2C_2                                /*!< PLLI2S division factor for PLL2C output by 4 */
#define DDL_RCM_PLL2C_DIV_5              (RCM_PLL2CFG_PLL2C_2 | RCM_PLL2CFG_PLL2C_0)        /*!< PLLI2S division factor for PLL2C output by 5 */
#define DDL_RCM_PLL2C_DIV_6              (RCM_PLL2CFG_PLL2C_2 | RCM_PLL2CFG_PLL2C_1)        /*!< PLLI2S division factor for PLL2C output by 6 */
#define DDL_RCM_PLL2C_DIV_7              (RCM_PLL2CFG_PLL2C_2 | RCM_PLL2CFG_PLL2C_1 | RCM_PLL2CFG_PLL2C_0)        /*!< PLLI2S division factor for PLL2C output by 7 */
/**
  * @}
  */

#endif /* RCM_PLLI2S_SUPPORT */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCM_DDL_Exported_Macros RCM Exported Macros
  * @{
  */

/** @defgroup RCM_DDL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in RCM register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define DDL_RCM_WriteReg(__REG__, __VALUE__) WRITE_REG(RCM->__REG__, (__VALUE__))

/**
  * @brief  Read a value in RCM register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define DDL_RCM_ReadReg(__REG__) READ_REG(RCM->__REG__)
/**
  * @}
  */

/** @defgroup RCM_DDL_EM_CALC_FREQ Calculate frequencies
  * @{
  */

