betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rcm.h
#if defined(APM32F403xx) || defined(APM32F402xx)
/**
  * @brief  Helper macro to calculate the PLLCLK frequency
  * @note ex: @ref __DDL_RCM_CALC_PLLCLK_FREQ (HSE_VALUE / (@ref DDL_RCM_PLL_GetPrediv () + 1), @ref DDL_RCM_PLL_GetMultiplicator ());
  * @param  __INPUTFREQ__ PLL Input frequency (based on HSE div Prediv1 or div 2 / HSI div 2)
  * @param  __PLLMUL__: This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLL_MUL_2
  *         @arg @ref DDL_RCM_PLL_MUL_3
  *         @arg @ref DDL_RCM_PLL_MUL_4
  *         @arg @ref DDL_RCM_PLL_MUL_5
  *         @arg @ref DDL_RCM_PLL_MUL_6
  *         @arg @ref DDL_RCM_PLL_MUL_7
  *         @arg @ref DDL_RCM_PLL_MUL_8
  *         @arg @ref DDL_RCM_PLL_MUL_9
  *         @arg @ref DDL_RCM_PLL_MUL_10
  *         @arg @ref DDL_RCM_PLL_MUL_11
  *         @arg @ref DDL_RCM_PLL_MUL_12
  *         @arg @ref DDL_RCM_PLL_MUL_13
  *         @arg @ref DDL_RCM_PLL_MUL_14
  *         @arg @ref DDL_RCM_PLL_MUL_15
  *         @arg @ref DDL_RCM_PLL_MUL_16
  * @retval PLL clock frequency (in Hz)
  */
#define __DDL_RCM_CALC_PLLCLK_FREQ(__INPUTFREQ__, __PLLMUL__) ((__INPUTFREQ__) * (((__PLLMUL__) >> RCM_CFG_PLLMULCFG_Pos) + 2U))
#else
/**
  * @brief  Helper macro to calculate the PLLCLK frequency on system domain
  * @note ex: @ref __DDL_RCM_CALC_PLLCLK_FREQ (HSE_VALUE,@ref DDL_RCM_PLL_GetDivider (),
  *             @ref DDL_RCM_PLL_GetN (), @ref DDL_RCM_PLL_GetP ());
  * @param  __INPUTFREQ__ PLL Input frequency (based on HSE/HSI)
  * @param  __PLLB__ This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLB_DIV_2
  *         @arg @ref DDL_RCM_PLLB_DIV_3
  *         @arg @ref DDL_RCM_PLLB_DIV_4
  *         @arg @ref DDL_RCM_PLLB_DIV_5
  *         @arg @ref DDL_RCM_PLLB_DIV_6
  *         @arg @ref DDL_RCM_PLLB_DIV_7
  *         @arg @ref DDL_RCM_PLLB_DIV_8
  *         @arg @ref DDL_RCM_PLLB_DIV_9
  *         @arg @ref DDL_RCM_PLLB_DIV_10
  *         @arg @ref DDL_RCM_PLLB_DIV_11
  *         @arg @ref DDL_RCM_PLLB_DIV_12
  *         @arg @ref DDL_RCM_PLLB_DIV_13
  *         @arg @ref DDL_RCM_PLLB_DIV_14
  *         @arg @ref DDL_RCM_PLLB_DIV_15
  *         @arg @ref DDL_RCM_PLLB_DIV_16
  *         @arg @ref DDL_RCM_PLLB_DIV_17
  *         @arg @ref DDL_RCM_PLLB_DIV_18
  *         @arg @ref DDL_RCM_PLLB_DIV_19
  *         @arg @ref DDL_RCM_PLLB_DIV_20
  *         @arg @ref DDL_RCM_PLLB_DIV_21
  *         @arg @ref DDL_RCM_PLLB_DIV_22
  *         @arg @ref DDL_RCM_PLLB_DIV_23
  *         @arg @ref DDL_RCM_PLLB_DIV_24
  *         @arg @ref DDL_RCM_PLLB_DIV_25
  *         @arg @ref DDL_RCM_PLLB_DIV_26
  *         @arg @ref DDL_RCM_PLLB_DIV_27
  *         @arg @ref DDL_RCM_PLLB_DIV_28
  *         @arg @ref DDL_RCM_PLLB_DIV_29
  *         @arg @ref DDL_RCM_PLLB_DIV_30
  *         @arg @ref DDL_RCM_PLLB_DIV_31
  *         @arg @ref DDL_RCM_PLLB_DIV_32
  *         @arg @ref DDL_RCM_PLLB_DIV_33
  *         @arg @ref DDL_RCM_PLLB_DIV_34
  *         @arg @ref DDL_RCM_PLLB_DIV_35
  *         @arg @ref DDL_RCM_PLLB_DIV_36
  *         @arg @ref DDL_RCM_PLLB_DIV_37
  *         @arg @ref DDL_RCM_PLLB_DIV_38
  *         @arg @ref DDL_RCM_PLLB_DIV_39
  *         @arg @ref DDL_RCM_PLLB_DIV_40
  *         @arg @ref DDL_RCM_PLLB_DIV_41
  *         @arg @ref DDL_RCM_PLLB_DIV_42
  *         @arg @ref DDL_RCM_PLLB_DIV_43
  *         @arg @ref DDL_RCM_PLLB_DIV_44
  *         @arg @ref DDL_RCM_PLLB_DIV_45
  *         @arg @ref DDL_RCM_PLLB_DIV_46
  *         @arg @ref DDL_RCM_PLLB_DIV_47
  *         @arg @ref DDL_RCM_PLLB_DIV_48
  *         @arg @ref DDL_RCM_PLLB_DIV_49
  *         @arg @ref DDL_RCM_PLLB_DIV_50
  *         @arg @ref DDL_RCM_PLLB_DIV_51
  *         @arg @ref DDL_RCM_PLLB_DIV_52
  *         @arg @ref DDL_RCM_PLLB_DIV_53
  *         @arg @ref DDL_RCM_PLLB_DIV_54
  *         @arg @ref DDL_RCM_PLLB_DIV_55
  *         @arg @ref DDL_RCM_PLLB_DIV_56
  *         @arg @ref DDL_RCM_PLLB_DIV_57
  *         @arg @ref DDL_RCM_PLLB_DIV_58
  *         @arg @ref DDL_RCM_PLLB_DIV_59
  *         @arg @ref DDL_RCM_PLLB_DIV_60
  *         @arg @ref DDL_RCM_PLLB_DIV_61
  *         @arg @ref DDL_RCM_PLLB_DIV_62
  *         @arg @ref DDL_RCM_PLLB_DIV_63
  * @param  __PLL1A__ Between 50/192(*) and 432
  *
  *         (*) value not defined in all devices.
  * @param  __PLL1C__ This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLL1C_DIV_2
  *         @arg @ref DDL_RCM_PLL1C_DIV_4
  *         @arg @ref DDL_RCM_PLL1C_DIV_6
  *         @arg @ref DDL_RCM_PLL1C_DIV_8
  * @retval PLL clock frequency (in Hz)
  */
#define __DDL_RCM_CALC_PLLCLK_FREQ(__INPUTFREQ__, __PLLB__, __PLL1A__, __PLL1C__) ((__INPUTFREQ__) / (__PLLB__) * (__PLL1A__) / \
                   ((((__PLL1C__) >> RCM_PLL1CFG_PLL1C_Pos ) + 1U) * 2U))

/**
  * @brief  Helper macro to calculate the PLLCLK frequency used on 48M domain
  * @note ex: @ref __DDL_RCM_CALC_PLLCLK_48M_FREQ (HSE_VALUE,@ref DDL_RCM_PLL_GetDivider (),
  *             @ref DDL_RCM_PLL_GetN (), @ref DDL_RCM_PLL_GetQ ());
  * @param  __INPUTFREQ__ PLL Input frequency (based on HSE/HSI)
  * @param  __PLLB__ This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLB_DIV_2
  *         @arg @ref DDL_RCM_PLLB_DIV_3
  *         @arg @ref DDL_RCM_PLLB_DIV_4
  *         @arg @ref DDL_RCM_PLLB_DIV_5
  *         @arg @ref DDL_RCM_PLLB_DIV_6
  *         @arg @ref DDL_RCM_PLLB_DIV_7
  *         @arg @ref DDL_RCM_PLLB_DIV_8
  *         @arg @ref DDL_RCM_PLLB_DIV_9
  *         @arg @ref DDL_RCM_PLLB_DIV_10
  *         @arg @ref DDL_RCM_PLLB_DIV_11
  *         @arg @ref DDL_RCM_PLLB_DIV_12
  *         @arg @ref DDL_RCM_PLLB_DIV_13
  *         @arg @ref DDL_RCM_PLLB_DIV_14
  *         @arg @ref DDL_RCM_PLLB_DIV_15
  *         @arg @ref DDL_RCM_PLLB_DIV_16
  *         @arg @ref DDL_RCM_PLLB_DIV_17
  *         @arg @ref DDL_RCM_PLLB_DIV_18
  *         @arg @ref DDL_RCM_PLLB_DIV_19
  *         @arg @ref DDL_RCM_PLLB_DIV_20
  *         @arg @ref DDL_RCM_PLLB_DIV_21
  *         @arg @ref DDL_RCM_PLLB_DIV_22
  *         @arg @ref DDL_RCM_PLLB_DIV_23
  *         @arg @ref DDL_RCM_PLLB_DIV_24
  *         @arg @ref DDL_RCM_PLLB_DIV_25
  *         @arg @ref DDL_RCM_PLLB_DIV_26
  *         @arg @ref DDL_RCM_PLLB_DIV_27
  *         @arg @ref DDL_RCM_PLLB_DIV_28
  *         @arg @ref DDL_RCM_PLLB_DIV_29
  *         @arg @ref DDL_RCM_PLLB_DIV_30
  *         @arg @ref DDL_RCM_PLLB_DIV_31
  *         @arg @ref DDL_RCM_PLLB_DIV_32
  *         @arg @ref DDL_RCM_PLLB_DIV_33
  *         @arg @ref DDL_RCM_PLLB_DIV_34
  *         @arg @ref DDL_RCM_PLLB_DIV_35
  *         @arg @ref DDL_RCM_PLLB_DIV_36
  *         @arg @ref DDL_RCM_PLLB_DIV_37
  *         @arg @ref DDL_RCM_PLLB_DIV_38
  *         @arg @ref DDL_RCM_PLLB_DIV_39
  *         @arg @ref DDL_RCM_PLLB_DIV_40
  *         @arg @ref DDL_RCM_PLLB_DIV_41
  *         @arg @ref DDL_RCM_PLLB_DIV_42
  *         @arg @ref DDL_RCM_PLLB_DIV_43
  *         @arg @ref DDL_RCM_PLLB_DIV_44
  *         @arg @ref DDL_RCM_PLLB_DIV_45
  *         @arg @ref DDL_RCM_PLLB_DIV_46
  *         @arg @ref DDL_RCM_PLLB_DIV_47
  *         @arg @ref DDL_RCM_PLLB_DIV_48
  *         @arg @ref DDL_RCM_PLLB_DIV_49
  *         @arg @ref DDL_RCM_PLLB_DIV_50
  *         @arg @ref DDL_RCM_PLLB_DIV_51
  *         @arg @ref DDL_RCM_PLLB_DIV_52
  *         @arg @ref DDL_RCM_PLLB_DIV_53
  *         @arg @ref DDL_RCM_PLLB_DIV_54
  *         @arg @ref DDL_RCM_PLLB_DIV_55
  *         @arg @ref DDL_RCM_PLLB_DIV_56
  *         @arg @ref DDL_RCM_PLLB_DIV_57
  *         @arg @ref DDL_RCM_PLLB_DIV_58
  *         @arg @ref DDL_RCM_PLLB_DIV_59
  *         @arg @ref DDL_RCM_PLLB_DIV_60
  *         @arg @ref DDL_RCM_PLLB_DIV_61
  *         @arg @ref DDL_RCM_PLLB_DIV_62
  *         @arg @ref DDL_RCM_PLLB_DIV_63
  * @param  __PLL1A__ Between 50/192(*) and 432
  *
  *         (*) value not defined in all devices.
  * @param  __PLLD__ This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLD_DIV_2
  *         @arg @ref DDL_RCM_PLLD_DIV_3
  *         @arg @ref DDL_RCM_PLLD_DIV_4
  *         @arg @ref DDL_RCM_PLLD_DIV_5
  *         @arg @ref DDL_RCM_PLLD_DIV_6
  *         @arg @ref DDL_RCM_PLLD_DIV_7
  *         @arg @ref DDL_RCM_PLLD_DIV_8
  *         @arg @ref DDL_RCM_PLLD_DIV_9
  *         @arg @ref DDL_RCM_PLLD_DIV_10
  *         @arg @ref DDL_RCM_PLLD_DIV_11
  *         @arg @ref DDL_RCM_PLLD_DIV_12
  *         @arg @ref DDL_RCM_PLLD_DIV_13
  *         @arg @ref DDL_RCM_PLLD_DIV_14
  *         @arg @ref DDL_RCM_PLLD_DIV_15
  * @retval PLL clock frequency (in Hz)
  */
#define __DDL_RCM_CALC_PLLCLK_48M_FREQ(__INPUTFREQ__, __PLLB__, __PLL1A__, __PLLD__) ((__INPUTFREQ__) / (__PLLB__) * (__PLL1A__) / \
                   ((__PLLD__) >> RCM_PLL1CFG_PLLD_Pos ))
#endif /* APM32F403xx || APM32F402xx */

#if defined(RCM_PLLI2S_SUPPORT)
/**
  * @brief  Helper macro to calculate the PLLI2S frequency used for I2S domain
  * @note ex: @ref __DDL_RCM_CALC_PLLI2S_I2S_FREQ (HSE_VALUE,@ref DDL_RCM_PLLI2S_GetDivider (),
  *             @ref DDL_RCM_PLLI2S_GetN (), @ref DDL_RCM_PLLI2S_GetR ());
  * @param  __INPUTFREQ__ PLL Input frequency (based on HSE/HSI)
  * @param  __PLLB__ This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLL2B_DIV_2
  *         @arg @ref DDL_RCM_PLL2B_DIV_3
  *         @arg @ref DDL_RCM_PLL2B_DIV_4
  *         @arg @ref DDL_RCM_PLL2B_DIV_5
  *         @arg @ref DDL_RCM_PLL2B_DIV_6
  *         @arg @ref DDL_RCM_PLL2B_DIV_7
  *         @arg @ref DDL_RCM_PLL2B_DIV_8
  *         @arg @ref DDL_RCM_PLL2B_DIV_9
  *         @arg @ref DDL_RCM_PLL2B_DIV_10
  *         @arg @ref DDL_RCM_PLL2B_DIV_11
  *         @arg @ref DDL_RCM_PLL2B_DIV_12
  *         @arg @ref DDL_RCM_PLL2B_DIV_13
  *         @arg @ref DDL_RCM_PLL2B_DIV_14
  *         @arg @ref DDL_RCM_PLL2B_DIV_15
  *         @arg @ref DDL_RCM_PLL2B_DIV_16
  *         @arg @ref DDL_RCM_PLL2B_DIV_17
  *         @arg @ref DDL_RCM_PLL2B_DIV_18
  *         @arg @ref DDL_RCM_PLL2B_DIV_19
  *         @arg @ref DDL_RCM_PLL2B_DIV_20
  *         @arg @ref DDL_RCM_PLL2B_DIV_21
  *         @arg @ref DDL_RCM_PLL2B_DIV_22
  *         @arg @ref DDL_RCM_PLL2B_DIV_23
  *         @arg @ref DDL_RCM_PLL2B_DIV_24
  *         @arg @ref DDL_RCM_PLL2B_DIV_25
  *         @arg @ref DDL_RCM_PLL2B_DIV_26
  *         @arg @ref DDL_RCM_PLL2B_DIV_27
  *         @arg @ref DDL_RCM_PLL2B_DIV_28
  *         @arg @ref DDL_RCM_PLL2B_DIV_29
  *         @arg @ref DDL_RCM_PLL2B_DIV_30
  *         @arg @ref DDL_RCM_PLL2B_DIV_31
  *         @arg @ref DDL_RCM_PLL2B_DIV_32
  *         @arg @ref DDL_RCM_PLL2B_DIV_33
  *         @arg @ref DDL_RCM_PLL2B_DIV_34
  *         @arg @ref DDL_RCM_PLL2B_DIV_35
  *         @arg @ref DDL_RCM_PLL2B_DIV_36
  *         @arg @ref DDL_RCM_PLL2B_DIV_37
  *         @arg @ref DDL_RCM_PLL2B_DIV_38
  *         @arg @ref DDL_RCM_PLL2B_DIV_39
  *         @arg @ref DDL_RCM_PLL2B_DIV_40
  *         @arg @ref DDL_RCM_PLL2B_DIV_41
  *         @arg @ref DDL_RCM_PLL2B_DIV_42
  *         @arg @ref DDL_RCM_PLL2B_DIV_43
  *         @arg @ref DDL_RCM_PLL2B_DIV_44
  *         @arg @ref DDL_RCM_PLL2B_DIV_45
  *         @arg @ref DDL_RCM_PLL2B_DIV_46
  *         @arg @ref DDL_RCM_PLL2B_DIV_47
  *         @arg @ref DDL_RCM_PLL2B_DIV_48
  *         @arg @ref DDL_RCM_PLL2B_DIV_49
  *         @arg @ref DDL_RCM_PLL2B_DIV_50
  *         @arg @ref DDL_RCM_PLL2B_DIV_51
  *         @arg @ref DDL_RCM_PLL2B_DIV_52
  *         @arg @ref DDL_RCM_PLL2B_DIV_53
  *         @arg @ref DDL_RCM_PLL2B_DIV_54
  *         @arg @ref DDL_RCM_PLL2B_DIV_55
  *         @arg @ref DDL_RCM_PLL2B_DIV_56
  *         @arg @ref DDL_RCM_PLL2B_DIV_57
  *         @arg @ref DDL_RCM_PLL2B_DIV_58
  *         @arg @ref DDL_RCM_PLL2B_DIV_59
  *         @arg @ref DDL_RCM_PLL2B_DIV_60
  *         @arg @ref DDL_RCM_PLL2B_DIV_61
  *         @arg @ref DDL_RCM_PLL2B_DIV_62
  *         @arg @ref DDL_RCM_PLL2B_DIV_63
  * @param  __PLL2A__ Between 50/192(*) and 432
  *
  *         (*) value not defined in all devices.
  * @param  __PLL2C__ This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLL2C_DIV_2
  *         @arg @ref DDL_RCM_PLL2C_DIV_3
  *         @arg @ref DDL_RCM_PLL2C_DIV_4
  *         @arg @ref DDL_RCM_PLL2C_DIV_5
  *         @arg @ref DDL_RCM_PLL2C_DIV_6
  *         @arg @ref DDL_RCM_PLL2C_DIV_7
  * @retval PLLI2S clock frequency (in Hz)
  */
#define __DDL_RCM_CALC_PLLI2S_I2S_FREQ(__INPUTFREQ__, __PLLB__, __PLL2A__, __PLL2C__) (((__INPUTFREQ__) / (__PLLB__)) * (__PLL2A__) / \
                   ((__PLL2C__) >> RCM_PLL2CFG_PLL2C_Pos))
#endif /* RCM_PLLI2S_SUPPORT */

/**
  * @brief  Helper macro to calculate the HCLK frequency
  * @param  __SYSCLKFREQ__ SYSCLK frequency (based on HSE/HSI/PLLCLK)
  * @param  __AHBPRESCALER__ This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_SYSCLK_DIV_1
  *         @arg @ref DDL_RCM_SYSCLK_DIV_2
  *         @arg @ref DDL_RCM_SYSCLK_DIV_4
  *         @arg @ref DDL_RCM_SYSCLK_DIV_8
  *         @arg @ref DDL_RCM_SYSCLK_DIV_16
  *         @arg @ref DDL_RCM_SYSCLK_DIV_64
  *         @arg @ref DDL_RCM_SYSCLK_DIV_128
  *         @arg @ref DDL_RCM_SYSCLK_DIV_256
  *         @arg @ref DDL_RCM_SYSCLK_DIV_512
  * @retval HCLK clock frequency (in Hz)
  */
#define __DDL_RCM_CALC_HCLK_FREQ(__SYSCLKFREQ__, __AHBPRESCALER__) ((__SYSCLKFREQ__) >> AHBPrescTable[((__AHBPRESCALER__) & RCM_CFG_AHBPSC) >>  RCM_CFG_AHBPSC_Pos])

/**
  * @brief  Helper macro to calculate the PCLK1 frequency (ABP1)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB1PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_APB1_DIV_1
  *         @arg @ref DDL_RCM_APB1_DIV_2
  *         @arg @ref DDL_RCM_APB1_DIV_4
  *         @arg @ref DDL_RCM_APB1_DIV_8
  *         @arg @ref DDL_RCM_APB1_DIV_16
  * @retval PCLK1 clock frequency (in Hz)
  */
#define __DDL_RCM_CALC_PCLK1_FREQ(__HCLKFREQ__, __APB1PRESCALER__) ((__HCLKFREQ__) >> APBPrescTable[(__APB1PRESCALER__) >>  RCM_CFG_APB1PSC_Pos])

/**
  * @brief  Helper macro to calculate the PCLK2 frequency (ABP2)
  * @param  __HCLKFREQ__ HCLK frequency
  * @param  __APB2PRESCALER__ This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_APB2_DIV_1
  *         @arg @ref DDL_RCM_APB2_DIV_2
  *         @arg @ref DDL_RCM_APB2_DIV_4
  *         @arg @ref DDL_RCM_APB2_DIV_8
  *         @arg @ref DDL_RCM_APB2_DIV_16
  * @retval PCLK2 clock frequency (in Hz)
  */
#define __DDL_RCM_CALC_PCLK2_FREQ(__HCLKFREQ__, __APB2PRESCALER__) ((__HCLKFREQ__) >> APBPrescTable[(__APB2PRESCALER__) >>  RCM_CFG_APB2PSC_Pos])

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup RCM_DDL_Exported_Functions RCM Exported Functions
  * @{
  */

