betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rcm.h
/** @defgroup RCM_DDL_EF_HSE HSE
  * @{
  */

/**
  * @brief  Enable the Clock Security System.
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_HSE_EnableCSS(void)
{
  SET_BIT(RCM->CTRL, RCM_CTRL_CSSEN);
}

/**
  * @brief  Enable HSE external oscillator (HSE Bypass)
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_HSE_EnableBypass(void)
{
  SET_BIT(RCM->CTRL, RCM_CTRL_HSEBCFG);
}

/**
  * @brief  Disable HSE external oscillator (HSE Bypass)
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_HSE_DisableBypass(void)
{
  CLEAR_BIT(RCM->CTRL, RCM_CTRL_HSEBCFG);
}

/**
  * @brief  Enable HSE crystal oscillator (HSE ON)
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_HSE_Enable(void)
{
  SET_BIT(RCM->CTRL, RCM_CTRL_HSEEN);
}

/**
  * @brief  Disable HSE crystal oscillator (HSE ON)
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_HSE_Disable(void)
{
  CLEAR_BIT(RCM->CTRL, RCM_CTRL_HSEEN);
}

/**
  * @brief  Check if HSE oscillator Ready
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_HSE_IsReady(void)
{
  return (READ_BIT(RCM->CTRL, RCM_CTRL_HSERDYFLG) == (RCM_CTRL_HSERDYFLG));
}

/**
  * @}
  */

/** @defgroup RCM_DDL_EF_HSI HSI
  * @{
  */

/**
  * @brief  Enable HSI oscillator
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_HSI_Enable(void)
{
  SET_BIT(RCM->CTRL, RCM_CTRL_HSIEN);
}

/**
  * @brief  Disable HSI oscillator
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_HSI_Disable(void)
{
  CLEAR_BIT(RCM->CTRL, RCM_CTRL_HSIEN);
}

/**
  * @brief  Check if HSI clock is ready
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_HSI_IsReady(void)
{
  return (READ_BIT(RCM->CTRL, RCM_CTRL_HSIRDYFLG) == (RCM_CTRL_HSIRDYFLG));
}

/**
  * @brief  Get HSI Calibration value
  * @note When HSITRIM is written, HSICAL is updated with the sum of
  *       HSITRIM and the factory trim value
  * @retval Between Min_Data = 0x00 and Max_Data = 0xFF
  */
__STATIC_INLINE uint32_t DDL_RCM_HSI_GetCalibration(void)
{
  return (uint32_t)(READ_BIT(RCM->CTRL, RCM_CTRL_HSICAL) >> RCM_CTRL_HSICAL_Pos);
}

/**
  * @brief  Set HSI Calibration trimming
  * @note user-programmable trimming value that is added to the HSICAL
  * @note Default value is 16, which, when added to the HSICAL value,
  *       should trim the HSI to 16 MHz +/- 1 %
  * @param  Value Between Min_Data = 0 and Max_Data = 31
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_HSI_SetCalibTrimming(uint32_t Value)
{
  MODIFY_REG(RCM->CTRL, RCM_CTRL_HSITRM, Value << RCM_CTRL_HSITRM_Pos);
}

/**
  * @brief  Get HSI Calibration trimming
  * @retval Between Min_Data = 0 and Max_Data = 31
  */
__STATIC_INLINE uint32_t DDL_RCM_HSI_GetCalibTrimming(void)
{
  return (uint32_t)(READ_BIT(RCM->CTRL, RCM_CTRL_HSITRM) >> RCM_CTRL_HSITRM_Pos);
}

/**
  * @}
  */

/** @defgroup RCM_DDL_EF_LSE LSE
  * @{
  */

/**
  * @brief  Enable  Low Speed External (LSE) crystal.
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_LSE_Enable(void)
{
  SET_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEEN);
}

/**
  * @brief  Disable  Low Speed External (LSE) crystal.
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_LSE_Disable(void)
{
  CLEAR_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEEN);
}

/**
  * @brief  Enable external clock source (LSE bypass).
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_LSE_EnableBypass(void)
{
  SET_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEBCFG);
}

/**
  * @brief  Disable external clock source (LSE bypass).
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_LSE_DisableBypass(void)
{
  CLEAR_BIT(RCM->BDCTRL, RCM_BDCTRL_LSEBCFG);
}

/**
  * @brief  Check if LSE oscillator Ready
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_LSE_IsReady(void)
{
  return (READ_BIT(RCM->BDCTRL, RCM_BDCTRL_LSERDYFLG) == (RCM_BDCTRL_LSERDYFLG));
}

/**
  * @}
  */

/** @defgroup RCM_DDL_EF_LSI LSI
  * @{
  */

/**
  * @brief  Enable LSI Oscillator
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_LSI_Enable(void)
{
  SET_BIT(RCM->CSTS, RCM_CSTS_LSIEN);
}

/**
  * @brief  Disable LSI Oscillator
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_LSI_Disable(void)
{
  CLEAR_BIT(RCM->CSTS, RCM_CSTS_LSIEN);
}

/**
  * @brief  Check if LSI is Ready
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_LSI_IsReady(void)
{
  return (READ_BIT(RCM->CSTS, RCM_CSTS_LSIRDYFLG) == (RCM_CSTS_LSIRDYFLG));
}

/**
  * @}
  */

/** @defgroup RCM_DDL_EF_System System
  * @{
  */

/**
  * @brief  Configure the system clock source
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_SYS_CLKSOURCE_HSI
  *         @arg @ref DDL_RCM_SYS_CLKSOURCE_HSE
  *         @arg @ref DDL_RCM_SYS_CLKSOURCE_PLL
  *         @arg @ref DDL_RCM_SYS_CLKSOURCE_PLLR (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_SetSysClkSource(uint32_t Source)
{
  MODIFY_REG(RCM->CFG, RCM_CFG_SCLKSEL, Source);
}

/**
  * @brief  Get the system clock source
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_SYS_CLKSOURCE_STATUS_HSI
  *         @arg @ref DDL_RCM_SYS_CLKSOURCE_STATUS_HSE
  *         @arg @ref DDL_RCM_SYS_CLKSOURCE_STATUS_PLL
  *         @arg @ref DDL_RCM_SYS_CLKSOURCE_STATUS_PLLR (*)
  *
  *         (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t DDL_RCM_GetSysClkSource(void)
{
  return (uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_SCLKSELSTS));
}

/**
  * @brief  Set AHB prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_SYSCLK_DIV_1
  *         @arg @ref DDL_RCM_SYSCLK_DIV_2
  *         @arg @ref DDL_RCM_SYSCLK_DIV_4
  *         @arg @ref DDL_RCM_SYSCLK_DIV_8
  *         @arg @ref DDL_RCM_SYSCLK_DIV_16
  *         @arg @ref DDL_RCM_SYSCLK_DIV_64
  *         @arg @ref DDL_RCM_SYSCLK_DIV_128
  *         @arg @ref DDL_RCM_SYSCLK_DIV_256
  *         @arg @ref DDL_RCM_SYSCLK_DIV_512
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_SetAHBPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCM->CFG, RCM_CFG_AHBPSC, Prescaler);
}

/**
  * @brief  Set APB1 prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_APB1_DIV_1
  *         @arg @ref DDL_RCM_APB1_DIV_2
  *         @arg @ref DDL_RCM_APB1_DIV_4
  *         @arg @ref DDL_RCM_APB1_DIV_8
  *         @arg @ref DDL_RCM_APB1_DIV_16
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_SetAPB1Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCM->CFG, RCM_CFG_APB1PSC, Prescaler);
}

/**
  * @brief  Set APB2 prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_APB2_DIV_1
  *         @arg @ref DDL_RCM_APB2_DIV_2
  *         @arg @ref DDL_RCM_APB2_DIV_4
  *         @arg @ref DDL_RCM_APB2_DIV_8
  *         @arg @ref DDL_RCM_APB2_DIV_16
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_SetAPB2Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCM->CFG, RCM_CFG_APB2PSC, Prescaler);
}

/**
  * @brief  Get AHB prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_SYSCLK_DIV_1
  *         @arg @ref DDL_RCM_SYSCLK_DIV_2
  *         @arg @ref DDL_RCM_SYSCLK_DIV_4
  *         @arg @ref DDL_RCM_SYSCLK_DIV_8
  *         @arg @ref DDL_RCM_SYSCLK_DIV_16
  *         @arg @ref DDL_RCM_SYSCLK_DIV_64
  *         @arg @ref DDL_RCM_SYSCLK_DIV_128
  *         @arg @ref DDL_RCM_SYSCLK_DIV_256
  *         @arg @ref DDL_RCM_SYSCLK_DIV_512
  */
__STATIC_INLINE uint32_t DDL_RCM_GetAHBPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_AHBPSC));
}

/**
  * @brief  Get APB1 prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_APB1_DIV_1
  *         @arg @ref DDL_RCM_APB1_DIV_2
  *         @arg @ref DDL_RCM_APB1_DIV_4
  *         @arg @ref DDL_RCM_APB1_DIV_8
  *         @arg @ref DDL_RCM_APB1_DIV_16
  */
__STATIC_INLINE uint32_t DDL_RCM_GetAPB1Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_APB1PSC));
}

/**
  * @brief  Get APB2 prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_APB2_DIV_1
  *         @arg @ref DDL_RCM_APB2_DIV_2
  *         @arg @ref DDL_RCM_APB2_DIV_4
  *         @arg @ref DDL_RCM_APB2_DIV_8
  *         @arg @ref DDL_RCM_APB2_DIV_16
  */
__STATIC_INLINE uint32_t DDL_RCM_GetAPB2Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_APB2PSC));
}

/**
  * @}
  */

/** @defgroup RCM_DDL_EF_MCO MCO
  * @{
  */

#if defined(APM32F403xx) || defined(APM32F402xx)
/**
  * @brief  Configure MCOx
  * @param  MCOxSource This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_MCO1SOURCE_NOCLOCK
  *         @arg @ref DDL_RCM_MCO1SOURCE_SYSCLK
  *         @arg @ref DDL_RCM_MCO1SOURCE_HSI
  *         @arg @ref DDL_RCM_MCO1SOURCE_HSE
  *         @arg @ref DDL_RCM_MCO1SOURCE_PLLCLK_DIV_2
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ConfigMCO(uint32_t MCOxSource)
{
  MODIFY_REG(RCM->CFG, RCM_CFG_MCOSEL, MCOxSource);
}
#else
/**
  * @brief  Configure MCOx
  * @param  MCOxSource This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_MCO1SOURCE_HSI
  *         @arg @ref DDL_RCM_MCO1SOURCE_LSE
  *         @arg @ref DDL_RCM_MCO1SOURCE_HSE
  *         @arg @ref DDL_RCM_MCO1SOURCE_PLLCLK
  *         @arg @ref DDL_RCM_MCO2SOURCE_SYSCLK
  *         @arg @ref DDL_RCM_MCO2SOURCE_PLLI2S (*)
  *         @arg @ref DDL_RCM_MCO2SOURCE_HSE
  *         @arg @ref DDL_RCM_MCO2SOURCE_PLLCLK
  * @param  MCOxPrescaler This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_MCO1_DIV_1
  *         @arg @ref DDL_RCM_MCO1_DIV_2
  *         @arg @ref DDL_RCM_MCO1_DIV_3
  *         @arg @ref DDL_RCM_MCO1_DIV_4
  *         @arg @ref DDL_RCM_MCO1_DIV_5
  *         @arg @ref DDL_RCM_MCO2_DIV_1
  *         @arg @ref DDL_RCM_MCO2_DIV_2
  *         @arg @ref DDL_RCM_MCO2_DIV_3
  *         @arg @ref DDL_RCM_MCO2_DIV_4
  *         @arg @ref DDL_RCM_MCO2_DIV_5
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ConfigMCO(uint32_t MCOxSource, uint32_t MCOxPrescaler)
{
  MODIFY_REG(RCM->CFG, (MCOxSource & 0xFFFF0000U) | (MCOxPrescaler & 0xFFFF0000U),  (MCOxSource << 16U) | (MCOxPrescaler << 16U));
}
#endif /* APM32F403xx || APM32F402xx */

/**
  * @}
  */

/** @defgroup RCM_DDL_EF_Peripheral_Clock_Source Peripheral Clock Source
  * @{
  */

