betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rcm.h
#if defined(RCM_CFG_I2SSEL)
/**
  * @brief  Configure I2S clock source
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_I2S1_CLKSOURCE_PLLI2S (*)
  *         @arg @ref DDL_RCM_I2S1_CLKSOURCE_PIN
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_SetI2SClockSource(uint32_t Source)
{
  MODIFY_REG(RCM->CFG, RCM_CFG_I2SSEL, Source);
}

/**
  * @brief  Get I2S Clock Source
  * @param  I2Sx This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_I2S1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_I2S1_CLKSOURCE_PLLI2S (*)
  *         @arg @ref DDL_RCM_I2S1_CLKSOURCE_PIN
  *
  *         (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t DDL_RCM_GetI2SClockSource(uint32_t I2Sx)
{
  return (uint32_t)(READ_BIT(RCM->CFG, I2Sx));
}
#endif /* RCM_CFG_I2SSEL */

#if defined(RCM_CFG_OTGFSPSC)
/**
  * @brief  Configure USB clock source
  * @param  USBxSource This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_USB_CLKSOURCE_PLL_DIV_1_5
  *         @arg @ref DDL_RCM_USB_CLKSOURCE_PLL
  *         @arg @ref DDL_RCM_USB_CLKSOURCE_PLL_DIV_2
  *         @arg @ref DDL_RCM_USB_CLKSOURCE_PLL_DIV_2_5
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_SetUSBClockSource(uint32_t USBxSource)
{
  MODIFY_REG(RCM->CFG, RCM_CFG_OTGFSPSC, USBxSource);
}

/**
  * @brief  Get USB Clock Source
  * @param  USBx This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_USB_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_USB_CLKSOURCE_PLL_DIV_1_5
  *         @arg @ref DDL_RCM_USB_CLKSOURCE_PLL
  *         @arg @ref DDL_RCM_USB_CLKSOURCE_PLL_DIV_2
  *         @arg @ref DDL_RCM_USB_CLKSOURCE_PLL_DIV_2_5
  */
__STATIC_INLINE uint32_t DDL_RCM_GetUSBClockSource(uint32_t USBx)
{
  return (uint32_t)(READ_BIT(RCM->CFG, USBx));
}
#endif /* RCM_CFG_OTGFSPSC */

#if defined(RCM_CFG_ADCPSC)
/**
  * @brief  Configure ADC clock source
  * @param  ADCxSource This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_ADC_CLKSRC_PCLK2_DIV_2
  *         @arg @ref DDL_RCM_ADC_CLKSRC_PCLK2_DIV_4
  *         @arg @ref DDL_RCM_ADC_CLKSRC_PCLK2_DIV_6
  *         @arg @ref DDL_RCM_ADC_CLKSRC_PCLK2_DIV_8
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_SetADCClockSource(uint32_t ADCxSource)
{
  MODIFY_REG(RCM->CFG, RCM_CFG_ADCPSC, ADCxSource);
}

/**
  * @brief  Get ADC Clock Source
  * @param  ADCx This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_ADC_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_ADC_CLKSRC_PCLK2_DIV_2
  *         @arg @ref DDL_RCM_ADC_CLKSRC_PCLK2_DIV_4
  *         @arg @ref DDL_RCM_ADC_CLKSRC_PCLK2_DIV_6
  *         @arg @ref DDL_RCM_ADC_CLKSRC_PCLK2_DIV_8
  */
__STATIC_INLINE uint32_t DDL_RCM_GetADCClockSource(uint32_t ADCx)
{
  return (uint32_t)(READ_BIT(RCM->CFG, ADCx));
}
#endif /* RCM_CFG_ADCPSC */

/**
  * @}
  */

/** @defgroup RCM_DDL_EF_RTC RTC
  * @{
  */

/**
  * @brief  Set RTC Clock Source
  * @note Once the RTC clock source has been selected, it cannot be changed anymore unless
  *       the Backup domain is reset, or unless a failure is detected on LSE (LSECSSD is
  *       set). The BDRST bit can be used to reset them.
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_RTC_CLKSOURCE_NONE
  *         @arg @ref DDL_RCM_RTC_CLKSOURCE_LSE
  *         @arg @ref DDL_RCM_RTC_CLKSOURCE_LSI
  *         @arg @ref DDL_RCM_RTC_CLKSOURCE_HSE
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_SetRTCClockSource(uint32_t Source)
{
  MODIFY_REG(RCM->BDCTRL, RCM_BDCTRL_RTCSRCSEL, Source);
}

/**
  * @brief  Get RTC Clock Source
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_RTC_CLKSOURCE_NONE
  *         @arg @ref DDL_RCM_RTC_CLKSOURCE_LSE
  *         @arg @ref DDL_RCM_RTC_CLKSOURCE_LSI
  *         @arg @ref DDL_RCM_RTC_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t DDL_RCM_GetRTCClockSource(void)
{
  return (uint32_t)(READ_BIT(RCM->BDCTRL, RCM_BDCTRL_RTCSRCSEL));
}

/**
  * @brief  Enable RTC
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_EnableRTC(void)
{
  SET_BIT(RCM->BDCTRL, RCM_BDCTRL_RTCCLKEN);
}

/**
  * @brief  Disable RTC
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_DisableRTC(void)
{
  CLEAR_BIT(RCM->BDCTRL, RCM_BDCTRL_RTCCLKEN);
}

/**
  * @brief  Check if RTC has been enabled or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsEnabledRTC(void)
{
  return (READ_BIT(RCM->BDCTRL, RCM_BDCTRL_RTCCLKEN) == (RCM_BDCTRL_RTCCLKEN));
}

/**
  * @brief  Force the Backup domain reset
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ForceBackupDomainReset(void)
{
  SET_BIT(RCM->BDCTRL, RCM_BDCTRL_BDRST);
}

/**
  * @brief  Release the Backup domain reset
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ReleaseBackupDomainReset(void)
{
  CLEAR_BIT(RCM->BDCTRL, RCM_BDCTRL_BDRST);
}

#if defined(RCM_CFG_RTCPSC)
/**
  * @brief  Set HSE Prescalers for RTC Clock
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_RTC_NOCLOCK
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_2
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_3
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_4
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_5
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_6
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_7
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_8
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_9
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_10
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_11
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_12
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_13
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_14
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_15
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_16
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_17
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_18
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_19
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_20
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_21
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_22
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_23
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_24
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_25
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_26
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_27
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_28
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_29
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_30
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_31
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_SetRTC_HSEPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCM->CFG, RCM_CFG_RTCPSC, Prescaler);
}

/**
  * @brief  Get HSE Prescalers for RTC Clock
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_RTC_NOCLOCK
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_2
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_3
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_4
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_5
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_6
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_7
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_8
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_9
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_10
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_11
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_12
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_13
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_14
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_15
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_16
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_17
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_18
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_19
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_20
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_21
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_22
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_23
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_24
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_25
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_26
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_27
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_28
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_29
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_30
  *         @arg @ref DDL_RCM_RTC_HSE_DIV_31
  */
__STATIC_INLINE uint32_t DDL_RCM_GetRTC_HSEPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_RTCPSC));
}
#endif /* RCM_CFG_RTCPSC */

/**
  * @}
  */

