betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rcm.h
#if defined(RCM_CFGSEL_CLKPSEL)
/** @defgroup RCM_DDL_EF_TMR_CLOCK_PRESCALER TMR
  * @{
  */

/**
  * @brief  Set Timers Clock Prescalers
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_TMR_PRESCALER_TWICE
  *         @arg @ref DDL_RCM_TMR_PRESCALER_FOUR_TIMES
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_SetTMRPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCM->CFGSEL, RCM_CFGSEL_CLKPSEL, Prescaler);
}

/**
  * @brief  Get Timers Clock Prescalers
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_TMR_PRESCALER_TWICE
  *         @arg @ref DDL_RCM_TMR_PRESCALER_FOUR_TIMES
  */
__STATIC_INLINE uint32_t DDL_RCM_GetTMRPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCM->CFGSEL, RCM_CFGSEL_CLKPSEL));
}

/**
  * @}
  */
#endif /* RCM_CFGSEL_CLKPSEL */

/** @defgroup RCM_DDL_EF_PLL PLL
  * @{
  */

/**
  * @brief  Enable PLL
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLL_Enable(void)
{
  SET_BIT(RCM->CTRL, RCM_CTRL_PLL1EN);
}

/**
  * @brief  Disable PLL
  * @note Cannot be disabled if the PLL clock is used as the system clock
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLL_Disable(void)
{
  CLEAR_BIT(RCM->CTRL, RCM_CTRL_PLL1EN);
}

/**
  * @brief  Check if PLL Ready
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_IsReady(void)
{
  return (READ_BIT(RCM->CTRL, RCM_CTRL_PLL1RDYFLG) == (RCM_CTRL_PLL1RDYFLG));
}

#if defined(APM32F403xx) || defined(APM32F402xx)
/**
  * @brief  Configure PLL used for SYSCLK Domain
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLSOURCE_HSI_DIV_2
  *         @arg @ref DDL_RCM_PLLSOURCE_HSE
  *         @arg @ref DDL_RCM_PLLSOURCE_HSE_DIV_2
  * @param  PLLMul This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLL_MUL_2
  *         @arg @ref DDL_RCM_PLL_MUL_3
  *         @arg @ref DDL_RCM_PLL_MUL_4
  *         @arg @ref DDL_RCM_PLL_MUL_5
  *         @arg @ref DDL_RCM_PLL_MUL_6
  *         @arg @ref DDL_RCM_PLL_MUL_7
  *         @arg @ref DDL_RCM_PLL_MUL_8
  *         @arg @ref DDL_RCM_PLL_MUL_9
  *         @arg @ref DDL_RCM_PLL_MUL_10
  *         @arg @ref DDL_RCM_PLL_MUL_11
  *         @arg @ref DDL_RCM_PLL_MUL_12
  *         @arg @ref DDL_RCM_PLL_MUL_13
  *         @arg @ref DDL_RCM_PLL_MUL_14
  *         @arg @ref DDL_RCM_PLL_MUL_15
  *         @arg @ref DDL_RCM_PLL_MUL_16
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLL_ConfigDomain_SYS(uint32_t Source, uint32_t PLLMul)
{
  MODIFY_REG(RCM->CFG, RCM_CFG_PLLSRCSEL | RCM_CFG_PLLHSEPSC | RCM_CFG_PLLMULCFG,
             (Source & (RCM_CFG_PLLSRCSEL | RCM_CFG_PLLHSEPSC)) | PLLMul);
}
#else
/**
  * @brief  Configure PLL used for SYSCLK Domain
  * @note PLL Source and PLLB Divider can be written only when PLL,
  *       PLLI2S and PLLSAI(*) are disabled
  * @note PLL1A/PLL1C can be written only when PLL is disabled
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLSOURCE_HSI
  *         @arg @ref DDL_RCM_PLLSOURCE_HSE
  * @param  PLLB This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLB_DIV_2
  *         @arg @ref DDL_RCM_PLLB_DIV_3
  *         @arg @ref DDL_RCM_PLLB_DIV_4
  *         @arg @ref DDL_RCM_PLLB_DIV_5
  *         @arg @ref DDL_RCM_PLLB_DIV_6
  *         @arg @ref DDL_RCM_PLLB_DIV_7
  *         @arg @ref DDL_RCM_PLLB_DIV_8
  *         @arg @ref DDL_RCM_PLLB_DIV_9
  *         @arg @ref DDL_RCM_PLLB_DIV_10
  *         @arg @ref DDL_RCM_PLLB_DIV_11
  *         @arg @ref DDL_RCM_PLLB_DIV_12
  *         @arg @ref DDL_RCM_PLLB_DIV_13
  *         @arg @ref DDL_RCM_PLLB_DIV_14
  *         @arg @ref DDL_RCM_PLLB_DIV_15
  *         @arg @ref DDL_RCM_PLLB_DIV_16
  *         @arg @ref DDL_RCM_PLLB_DIV_17
  *         @arg @ref DDL_RCM_PLLB_DIV_18
  *         @arg @ref DDL_RCM_PLLB_DIV_19
  *         @arg @ref DDL_RCM_PLLB_DIV_20
  *         @arg @ref DDL_RCM_PLLB_DIV_21
  *         @arg @ref DDL_RCM_PLLB_DIV_22
  *         @arg @ref DDL_RCM_PLLB_DIV_23
  *         @arg @ref DDL_RCM_PLLB_DIV_24
  *         @arg @ref DDL_RCM_PLLB_DIV_25
  *         @arg @ref DDL_RCM_PLLB_DIV_26
  *         @arg @ref DDL_RCM_PLLB_DIV_27
  *         @arg @ref DDL_RCM_PLLB_DIV_28
  *         @arg @ref DDL_RCM_PLLB_DIV_29
  *         @arg @ref DDL_RCM_PLLB_DIV_30
  *         @arg @ref DDL_RCM_PLLB_DIV_31
  *         @arg @ref DDL_RCM_PLLB_DIV_32
  *         @arg @ref DDL_RCM_PLLB_DIV_33
  *         @arg @ref DDL_RCM_PLLB_DIV_34
  *         @arg @ref DDL_RCM_PLLB_DIV_35
  *         @arg @ref DDL_RCM_PLLB_DIV_36
  *         @arg @ref DDL_RCM_PLLB_DIV_37
  *         @arg @ref DDL_RCM_PLLB_DIV_38
  *         @arg @ref DDL_RCM_PLLB_DIV_39
  *         @arg @ref DDL_RCM_PLLB_DIV_40
  *         @arg @ref DDL_RCM_PLLB_DIV_41
  *         @arg @ref DDL_RCM_PLLB_DIV_42
  *         @arg @ref DDL_RCM_PLLB_DIV_43
  *         @arg @ref DDL_RCM_PLLB_DIV_44
  *         @arg @ref DDL_RCM_PLLB_DIV_45
  *         @arg @ref DDL_RCM_PLLB_DIV_46
  *         @arg @ref DDL_RCM_PLLB_DIV_47
  *         @arg @ref DDL_RCM_PLLB_DIV_48
  *         @arg @ref DDL_RCM_PLLB_DIV_49
  *         @arg @ref DDL_RCM_PLLB_DIV_50
  *         @arg @ref DDL_RCM_PLLB_DIV_51
  *         @arg @ref DDL_RCM_PLLB_DIV_52
  *         @arg @ref DDL_RCM_PLLB_DIV_53
  *         @arg @ref DDL_RCM_PLLB_DIV_54
  *         @arg @ref DDL_RCM_PLLB_DIV_55
  *         @arg @ref DDL_RCM_PLLB_DIV_56
  *         @arg @ref DDL_RCM_PLLB_DIV_57
  *         @arg @ref DDL_RCM_PLLB_DIV_58
  *         @arg @ref DDL_RCM_PLLB_DIV_59
  *         @arg @ref DDL_RCM_PLLB_DIV_60
  *         @arg @ref DDL_RCM_PLLB_DIV_61
  *         @arg @ref DDL_RCM_PLLB_DIV_62
  *         @arg @ref DDL_RCM_PLLB_DIV_63
  * @param  PLL1A Between 50/192(*) and 432
  *
  *         (*) value not defined in all devices.
  * @param  PLL1C_R This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLL1C_DIV_2
  *         @arg @ref DDL_RCM_PLL1C_DIV_4
  *         @arg @ref DDL_RCM_PLL1C_DIV_6
  *         @arg @ref DDL_RCM_PLL1C_DIV_8
  *         @arg @ref DDL_RCM_PLLR_DIV_2 (*)
  *         @arg @ref DDL_RCM_PLLR_DIV_3 (*)
  *         @arg @ref DDL_RCM_PLLR_DIV_4 (*)
  *         @arg @ref DDL_RCM_PLLR_DIV_5 (*)
  *         @arg @ref DDL_RCM_PLLR_DIV_6 (*)
  *         @arg @ref DDL_RCM_PLLR_DIV_7 (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLL_ConfigDomain_SYS(uint32_t Source, uint32_t PLLB, uint32_t PLL1A, uint32_t PLL1C_R)
{
  MODIFY_REG(RCM->PLL1CFG, RCM_PLL1CFG_PLL1CLKS | RCM_PLL1CFG_PLLB | RCM_PLL1CFG_PLL1A,
             Source | PLLB | PLL1A << RCM_PLL1CFG_PLL1A_Pos);
  MODIFY_REG(RCM->PLL1CFG, RCM_PLL1CFG_PLL1C, PLL1C_R);
}

/**
  * @brief  Configure PLL used for 48Mhz domain clock
  * @note PLL Source and PLLB Divider can be written only when PLL,
  *       PLLI2S and PLLSAI(*) are disabled
  * @note PLL1A/PLLD can be written only when PLL is disabled
  * @note This  can be selected for USB, RNG, SDIO
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLSOURCE_HSI
  *         @arg @ref DDL_RCM_PLLSOURCE_HSE
  * @param  PLLB This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLB_DIV_2
  *         @arg @ref DDL_RCM_PLLB_DIV_3
  *         @arg @ref DDL_RCM_PLLB_DIV_4
  *         @arg @ref DDL_RCM_PLLB_DIV_5
  *         @arg @ref DDL_RCM_PLLB_DIV_6
  *         @arg @ref DDL_RCM_PLLB_DIV_7
  *         @arg @ref DDL_RCM_PLLB_DIV_8
  *         @arg @ref DDL_RCM_PLLB_DIV_9
  *         @arg @ref DDL_RCM_PLLB_DIV_10
  *         @arg @ref DDL_RCM_PLLB_DIV_11
  *         @arg @ref DDL_RCM_PLLB_DIV_12
  *         @arg @ref DDL_RCM_PLLB_DIV_13
  *         @arg @ref DDL_RCM_PLLB_DIV_14
  *         @arg @ref DDL_RCM_PLLB_DIV_15
  *         @arg @ref DDL_RCM_PLLB_DIV_16
  *         @arg @ref DDL_RCM_PLLB_DIV_17
  *         @arg @ref DDL_RCM_PLLB_DIV_18
  *         @arg @ref DDL_RCM_PLLB_DIV_19
  *         @arg @ref DDL_RCM_PLLB_DIV_20
  *         @arg @ref DDL_RCM_PLLB_DIV_21
  *         @arg @ref DDL_RCM_PLLB_DIV_22
  *         @arg @ref DDL_RCM_PLLB_DIV_23
  *         @arg @ref DDL_RCM_PLLB_DIV_24
  *         @arg @ref DDL_RCM_PLLB_DIV_25
  *         @arg @ref DDL_RCM_PLLB_DIV_26
  *         @arg @ref DDL_RCM_PLLB_DIV_27
  *         @arg @ref DDL_RCM_PLLB_DIV_28
  *         @arg @ref DDL_RCM_PLLB_DIV_29
  *         @arg @ref DDL_RCM_PLLB_DIV_30
  *         @arg @ref DDL_RCM_PLLB_DIV_31
  *         @arg @ref DDL_RCM_PLLB_DIV_32
  *         @arg @ref DDL_RCM_PLLB_DIV_33
  *         @arg @ref DDL_RCM_PLLB_DIV_34
  *         @arg @ref DDL_RCM_PLLB_DIV_35
  *         @arg @ref DDL_RCM_PLLB_DIV_36
  *         @arg @ref DDL_RCM_PLLB_DIV_37
  *         @arg @ref DDL_RCM_PLLB_DIV_38
  *         @arg @ref DDL_RCM_PLLB_DIV_39
  *         @arg @ref DDL_RCM_PLLB_DIV_40
  *         @arg @ref DDL_RCM_PLLB_DIV_41
  *         @arg @ref DDL_RCM_PLLB_DIV_42
  *         @arg @ref DDL_RCM_PLLB_DIV_43
  *         @arg @ref DDL_RCM_PLLB_DIV_44
  *         @arg @ref DDL_RCM_PLLB_DIV_45
  *         @arg @ref DDL_RCM_PLLB_DIV_46
  *         @arg @ref DDL_RCM_PLLB_DIV_47
  *         @arg @ref DDL_RCM_PLLB_DIV_48
  *         @arg @ref DDL_RCM_PLLB_DIV_49
  *         @arg @ref DDL_RCM_PLLB_DIV_50
  *         @arg @ref DDL_RCM_PLLB_DIV_51
  *         @arg @ref DDL_RCM_PLLB_DIV_52
  *         @arg @ref DDL_RCM_PLLB_DIV_53
  *         @arg @ref DDL_RCM_PLLB_DIV_54
  *         @arg @ref DDL_RCM_PLLB_DIV_55
  *         @arg @ref DDL_RCM_PLLB_DIV_56
  *         @arg @ref DDL_RCM_PLLB_DIV_57
  *         @arg @ref DDL_RCM_PLLB_DIV_58
  *         @arg @ref DDL_RCM_PLLB_DIV_59
  *         @arg @ref DDL_RCM_PLLB_DIV_60
  *         @arg @ref DDL_RCM_PLLB_DIV_61
  *         @arg @ref DDL_RCM_PLLB_DIV_62
  *         @arg @ref DDL_RCM_PLLB_DIV_63
  * @param  PLL1A Between 50/192(*) and 432
  *
  *         (*) value not defined in all devices.
  * @param  PLLD This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLD_DIV_2
  *         @arg @ref DDL_RCM_PLLD_DIV_3
  *         @arg @ref DDL_RCM_PLLD_DIV_4
  *         @arg @ref DDL_RCM_PLLD_DIV_5
  *         @arg @ref DDL_RCM_PLLD_DIV_6
  *         @arg @ref DDL_RCM_PLLD_DIV_7
  *         @arg @ref DDL_RCM_PLLD_DIV_8
  *         @arg @ref DDL_RCM_PLLD_DIV_9
  *         @arg @ref DDL_RCM_PLLD_DIV_10
  *         @arg @ref DDL_RCM_PLLD_DIV_11
  *         @arg @ref DDL_RCM_PLLD_DIV_12
  *         @arg @ref DDL_RCM_PLLD_DIV_13
  *         @arg @ref DDL_RCM_PLLD_DIV_14
  *         @arg @ref DDL_RCM_PLLD_DIV_15
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLL_ConfigDomain_48M(uint32_t Source, uint32_t PLLB, uint32_t PLL1A, uint32_t PLLD)
{
  MODIFY_REG(RCM->PLL1CFG, RCM_PLL1CFG_PLL1CLKS | RCM_PLL1CFG_PLLB | RCM_PLL1CFG_PLL1A | RCM_PLL1CFG_PLLD,
             Source | PLLB | PLL1A << RCM_PLL1CFG_PLL1A_Pos | PLLD);
}
#endif /* APM32F403xx || APM32F402xx */

/**
  * @brief  Configure PLL clock source
  * @param PLLSource This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLSOURCE_HSI
  *         @arg @ref DDL_RCM_PLLSOURCE_HSE
  *
  * @param PLLSource This parameter can be one of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_RCM_PLLSOURCE_HSI_DIV_2
  *         @arg @ref DDL_RCM_PLLSOURCE_HSE
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLL_SetMainSource(uint32_t PLLSource)
{
#if defined(RCM_CFG_PLLSRCSEL)
  MODIFY_REG(RCM->CFG, RCM_CFG_PLLSRCSEL, PLLSource);
#else
  MODIFY_REG(RCM->PLL1CFG, RCM_PLL1CFG_PLL1CLKS, PLLSource);
#endif /* RCM_CFG_PLLSRCSEL */
}

/**
  * @brief  Get the oscillator used as PLL clock source.
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_PLLSOURCE_HSI
  *         @arg @ref DDL_RCM_PLLSOURCE_HSE
  *
  * @retval Returned value can be one of the following values(Only for APM32F402/403xx device):
  *         @arg @ref DDL_RCM_PLLSOURCE_HSI_DIV_2
  *         @arg @ref DDL_RCM_PLLSOURCE_HSE
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_GetMainSource(void)
{
#if defined(RCM_CFG_PLLSRCSEL)
  return (uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_PLLSRCSEL));
#else
  return (uint32_t)(READ_BIT(RCM->PLL1CFG, RCM_PLL1CFG_PLL1CLKS));
#endif /* RCM_CFG_PLLSRCSEL */
}

#if defined(APM32F403xx) || defined(APM32F402xx)
/**
  * @brief  Get PLL multiplication Factor
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_PLL_MUL_2
  *         @arg @ref DDL_RCM_PLL_MUL_3
  *         @arg @ref DDL_RCM_PLL_MUL_4
  *         @arg @ref DDL_RCM_PLL_MUL_5
  *         @arg @ref DDL_RCM_PLL_MUL_6
  *         @arg @ref DDL_RCM_PLL_MUL_7
  *         @arg @ref DDL_RCM_PLL_MUL_8
  *         @arg @ref DDL_RCM_PLL_MUL_9
  *         @arg @ref DDL_RCM_PLL_MUL_10
  *         @arg @ref DDL_RCM_PLL_MUL_11
  *         @arg @ref DDL_RCM_PLL_MUL_12
  *         @arg @ref DDL_RCM_PLL_MUL_13
  *         @arg @ref DDL_RCM_PLL_MUL_14
  *         @arg @ref DDL_RCM_PLL_MUL_15
  *         @arg @ref DDL_RCM_PLL_MUL_16
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_GetMultiplicator(void)
{
  return (uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_PLLMULCFG));
}

/**
  * @brief  Get PREDIV1 division factor for the main PLL
  * @note They can be written only when the PLL is disabled
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_PREDIV_DIV_1
  *         @arg @ref DDL_RCM_PREDIV_DIV_2
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_GetPrediv(void)
{
  return (uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_PLLHSEPSC) >> RCM_CFG_PLLHSEPSC_Pos);
}
#else
/**
  * @brief  Get Main PLL multiplication factor for VCO
  * @retval Between 50/192(*) and 432
  *
  *         (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_GetN(void)
{
  return (uint32_t)(READ_BIT(RCM->PLL1CFG, RCM_PLL1CFG_PLL1A) >>  RCM_PLL1CFG_PLL1A_Pos);
}

/**
  * @brief  Get Main PLL division factor for PLL1C
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_PLL1C_DIV_2
  *         @arg @ref DDL_RCM_PLL1C_DIV_4
  *         @arg @ref DDL_RCM_PLL1C_DIV_6
  *         @arg @ref DDL_RCM_PLL1C_DIV_8
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_GetP(void)
{
  return (uint32_t)(READ_BIT(RCM->PLL1CFG, RCM_PLL1CFG_PLL1C));
}

/**
  * @brief  Get Main PLL division factor for PLLD
  * @note used for PLL48MCLK selected for USB, RNG, SDIO (48 MHz clock)
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_PLLD_DIV_2
  *         @arg @ref DDL_RCM_PLLD_DIV_3
  *         @arg @ref DDL_RCM_PLLD_DIV_4
  *         @arg @ref DDL_RCM_PLLD_DIV_5
  *         @arg @ref DDL_RCM_PLLD_DIV_6
  *         @arg @ref DDL_RCM_PLLD_DIV_7
  *         @arg @ref DDL_RCM_PLLD_DIV_8
  *         @arg @ref DDL_RCM_PLLD_DIV_9
  *         @arg @ref DDL_RCM_PLLD_DIV_10
  *         @arg @ref DDL_RCM_PLLD_DIV_11
  *         @arg @ref DDL_RCM_PLLD_DIV_12
  *         @arg @ref DDL_RCM_PLLD_DIV_13
  *         @arg @ref DDL_RCM_PLLD_DIV_14
  *         @arg @ref DDL_RCM_PLLD_DIV_15
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_GetQ(void)
{
  return (uint32_t)(READ_BIT(RCM->PLL1CFG, RCM_PLL1CFG_PLLD));
}

/**
  * @brief  Get Division factor for the main PLL and other PLL
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_PLLB_DIV_2
  *         @arg @ref DDL_RCM_PLLB_DIV_3
  *         @arg @ref DDL_RCM_PLLB_DIV_4
  *         @arg @ref DDL_RCM_PLLB_DIV_5
  *         @arg @ref DDL_RCM_PLLB_DIV_6
  *         @arg @ref DDL_RCM_PLLB_DIV_7
  *         @arg @ref DDL_RCM_PLLB_DIV_8
  *         @arg @ref DDL_RCM_PLLB_DIV_9
  *         @arg @ref DDL_RCM_PLLB_DIV_10
  *         @arg @ref DDL_RCM_PLLB_DIV_11
  *         @arg @ref DDL_RCM_PLLB_DIV_12
  *         @arg @ref DDL_RCM_PLLB_DIV_13
  *         @arg @ref DDL_RCM_PLLB_DIV_14
  *         @arg @ref DDL_RCM_PLLB_DIV_15
  *         @arg @ref DDL_RCM_PLLB_DIV_16
  *         @arg @ref DDL_RCM_PLLB_DIV_17
  *         @arg @ref DDL_RCM_PLLB_DIV_18
  *         @arg @ref DDL_RCM_PLLB_DIV_19
  *         @arg @ref DDL_RCM_PLLB_DIV_20
  *         @arg @ref DDL_RCM_PLLB_DIV_21
  *         @arg @ref DDL_RCM_PLLB_DIV_22
  *         @arg @ref DDL_RCM_PLLB_DIV_23
  *         @arg @ref DDL_RCM_PLLB_DIV_24
  *         @arg @ref DDL_RCM_PLLB_DIV_25
  *         @arg @ref DDL_RCM_PLLB_DIV_26
  *         @arg @ref DDL_RCM_PLLB_DIV_27
  *         @arg @ref DDL_RCM_PLLB_DIV_28
  *         @arg @ref DDL_RCM_PLLB_DIV_29
  *         @arg @ref DDL_RCM_PLLB_DIV_30
  *         @arg @ref DDL_RCM_PLLB_DIV_31
  *         @arg @ref DDL_RCM_PLLB_DIV_32
  *         @arg @ref DDL_RCM_PLLB_DIV_33
  *         @arg @ref DDL_RCM_PLLB_DIV_34
  *         @arg @ref DDL_RCM_PLLB_DIV_35
  *         @arg @ref DDL_RCM_PLLB_DIV_36
  *         @arg @ref DDL_RCM_PLLB_DIV_37
  *         @arg @ref DDL_RCM_PLLB_DIV_38
  *         @arg @ref DDL_RCM_PLLB_DIV_39
  *         @arg @ref DDL_RCM_PLLB_DIV_40
  *         @arg @ref DDL_RCM_PLLB_DIV_41
  *         @arg @ref DDL_RCM_PLLB_DIV_42
  *         @arg @ref DDL_RCM_PLLB_DIV_43
  *         @arg @ref DDL_RCM_PLLB_DIV_44
  *         @arg @ref DDL_RCM_PLLB_DIV_45
  *         @arg @ref DDL_RCM_PLLB_DIV_46
  *         @arg @ref DDL_RCM_PLLB_DIV_47
  *         @arg @ref DDL_RCM_PLLB_DIV_48
  *         @arg @ref DDL_RCM_PLLB_DIV_49
  *         @arg @ref DDL_RCM_PLLB_DIV_50
  *         @arg @ref DDL_RCM_PLLB_DIV_51
  *         @arg @ref DDL_RCM_PLLB_DIV_52
  *         @arg @ref DDL_RCM_PLLB_DIV_53
  *         @arg @ref DDL_RCM_PLLB_DIV_54
  *         @arg @ref DDL_RCM_PLLB_DIV_55
  *         @arg @ref DDL_RCM_PLLB_DIV_56
  *         @arg @ref DDL_RCM_PLLB_DIV_57
  *         @arg @ref DDL_RCM_PLLB_DIV_58
  *         @arg @ref DDL_RCM_PLLB_DIV_59
  *         @arg @ref DDL_RCM_PLLB_DIV_60
  *         @arg @ref DDL_RCM_PLLB_DIV_61
  *         @arg @ref DDL_RCM_PLLB_DIV_62
  *         @arg @ref DDL_RCM_PLLB_DIV_63
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_GetDivider(void)
{
  return (uint32_t)(READ_BIT(RCM->PLL1CFG, RCM_PLL1CFG_PLLB));
}

/**
  * @brief  Configure Spread Spectrum used for PLL
  * @note These bits must be written before enabling PLL
  * @param  Mod Between Min_Data=0 and Max_Data=8191
  * @param  Inc Between Min_Data=0 and Max_Data=32767
  * @param  Sel This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_SPREAD_SELECT_CENTER
  *         @arg @ref DDL_RCM_SPREAD_SELECT_DOWN
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLL_ConfigSpreadSpectrum(uint32_t Mod, uint32_t Inc, uint32_t Sel)
{
  MODIFY_REG(RCM->SSCCFG, RCM_SSCCFG_MODPCFG | RCM_SSCCFG_STEP | RCM_SSCCFG_SSSEL, Mod | (Inc << RCM_SSCCFG_STEP_Pos) | Sel);
}

/**
  * @brief  Get Spread Spectrum Modulation Period for PLL
  * @retval Between Min_Data=0 and Max_Data=8191
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_GetPeriodModulation(void)
{
  return (uint32_t)(READ_BIT(RCM->SSCCFG, RCM_SSCCFG_MODPCFG));
}

/**
  * @brief  Get Spread Spectrum Incrementation Step for PLL
  * @note Must be written before enabling PLL
  * @retval Between Min_Data=0 and Max_Data=32767
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_GetStepIncrementation(void)
{
  return (uint32_t)(READ_BIT(RCM->SSCCFG, RCM_SSCCFG_STEP) >> RCM_SSCCFG_STEP_Pos);
}

/**
  * @brief  Get Spread Spectrum Selection for PLL
  * @note Must be written before enabling PLL
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_SPREAD_SELECT_CENTER
  *         @arg @ref DDL_RCM_SPREAD_SELECT_DOWN
  */
__STATIC_INLINE uint32_t DDL_RCM_PLL_GetSpreadSelection(void)
{
  return (uint32_t)(READ_BIT(RCM->SSCCFG, RCM_SSCCFG_SSSEL));
}

/**
  * @brief  Enable Spread Spectrum for PLL.
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLL_SpreadSpectrum_Enable(void)
{
  SET_BIT(RCM->SSCCFG, RCM_SSCCFG_SSEN);
}

/**
  * @brief  Disable Spread Spectrum for PLL.
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLL_SpreadSpectrum_Disable(void)
{
  CLEAR_BIT(RCM->SSCCFG, RCM_SSCCFG_SSEN);
}
#endif /* APM32F403xx || APM32F402xx */
/**
  * @}
  */

#if defined(RCM_PLLI2S_SUPPORT)
/** @defgroup RCM_DDL_EF_PLLI2S PLLI2S
  * @{
  */

/**
  * @brief  Enable PLLI2S
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLLI2S_Enable(void)
{
  SET_BIT(RCM->CTRL, RCM_CTRL_PLL2EN);
}

/**
  * @brief  Disable PLLI2S
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLLI2S_Disable(void)
{
  CLEAR_BIT(RCM->CTRL, RCM_CTRL_PLL2EN);
}

/**
  * @brief  Check if PLLI2S Ready
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_PLLI2S_IsReady(void)
{
  return (READ_BIT(RCM->CTRL, RCM_CTRL_PLL2RDYFLG) == (RCM_CTRL_PLL2RDYFLG));
}

