betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_rcm.h
/**
  * @brief  Configure PLLI2S used for I2S1 domain clock
  * @note PLL Source and PLLB Divider can be written only when PLL,
  *       PLLI2S and PLLSAI(*) are disabled
  * @note PLL1A/PLLR can be written only when PLLI2S is disabled
  * @note This  can be selected for I2S
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLLSOURCE_HSI
  *         @arg @ref DDL_RCM_PLLSOURCE_HSE
  *
  *         (*) value not defined in all devices.
  * @param  PLLB This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLL2B_DIV_2
  *         @arg @ref DDL_RCM_PLL2B_DIV_3
  *         @arg @ref DDL_RCM_PLL2B_DIV_4
  *         @arg @ref DDL_RCM_PLL2B_DIV_5
  *         @arg @ref DDL_RCM_PLL2B_DIV_6
  *         @arg @ref DDL_RCM_PLL2B_DIV_7
  *         @arg @ref DDL_RCM_PLL2B_DIV_8
  *         @arg @ref DDL_RCM_PLL2B_DIV_9
  *         @arg @ref DDL_RCM_PLL2B_DIV_10
  *         @arg @ref DDL_RCM_PLL2B_DIV_11
  *         @arg @ref DDL_RCM_PLL2B_DIV_12
  *         @arg @ref DDL_RCM_PLL2B_DIV_13
  *         @arg @ref DDL_RCM_PLL2B_DIV_14
  *         @arg @ref DDL_RCM_PLL2B_DIV_15
  *         @arg @ref DDL_RCM_PLL2B_DIV_16
  *         @arg @ref DDL_RCM_PLL2B_DIV_17
  *         @arg @ref DDL_RCM_PLL2B_DIV_18
  *         @arg @ref DDL_RCM_PLL2B_DIV_19
  *         @arg @ref DDL_RCM_PLL2B_DIV_20
  *         @arg @ref DDL_RCM_PLL2B_DIV_21
  *         @arg @ref DDL_RCM_PLL2B_DIV_22
  *         @arg @ref DDL_RCM_PLL2B_DIV_23
  *         @arg @ref DDL_RCM_PLL2B_DIV_24
  *         @arg @ref DDL_RCM_PLL2B_DIV_25
  *         @arg @ref DDL_RCM_PLL2B_DIV_26
  *         @arg @ref DDL_RCM_PLL2B_DIV_27
  *         @arg @ref DDL_RCM_PLL2B_DIV_28
  *         @arg @ref DDL_RCM_PLL2B_DIV_29
  *         @arg @ref DDL_RCM_PLL2B_DIV_30
  *         @arg @ref DDL_RCM_PLL2B_DIV_31
  *         @arg @ref DDL_RCM_PLL2B_DIV_32
  *         @arg @ref DDL_RCM_PLL2B_DIV_33
  *         @arg @ref DDL_RCM_PLL2B_DIV_34
  *         @arg @ref DDL_RCM_PLL2B_DIV_35
  *         @arg @ref DDL_RCM_PLL2B_DIV_36
  *         @arg @ref DDL_RCM_PLL2B_DIV_37
  *         @arg @ref DDL_RCM_PLL2B_DIV_38
  *         @arg @ref DDL_RCM_PLL2B_DIV_39
  *         @arg @ref DDL_RCM_PLL2B_DIV_40
  *         @arg @ref DDL_RCM_PLL2B_DIV_41
  *         @arg @ref DDL_RCM_PLL2B_DIV_42
  *         @arg @ref DDL_RCM_PLL2B_DIV_43
  *         @arg @ref DDL_RCM_PLL2B_DIV_44
  *         @arg @ref DDL_RCM_PLL2B_DIV_45
  *         @arg @ref DDL_RCM_PLL2B_DIV_46
  *         @arg @ref DDL_RCM_PLL2B_DIV_47
  *         @arg @ref DDL_RCM_PLL2B_DIV_48
  *         @arg @ref DDL_RCM_PLL2B_DIV_49
  *         @arg @ref DDL_RCM_PLL2B_DIV_50
  *         @arg @ref DDL_RCM_PLL2B_DIV_51
  *         @arg @ref DDL_RCM_PLL2B_DIV_52
  *         @arg @ref DDL_RCM_PLL2B_DIV_53
  *         @arg @ref DDL_RCM_PLL2B_DIV_54
  *         @arg @ref DDL_RCM_PLL2B_DIV_55
  *         @arg @ref DDL_RCM_PLL2B_DIV_56
  *         @arg @ref DDL_RCM_PLL2B_DIV_57
  *         @arg @ref DDL_RCM_PLL2B_DIV_58
  *         @arg @ref DDL_RCM_PLL2B_DIV_59
  *         @arg @ref DDL_RCM_PLL2B_DIV_60
  *         @arg @ref DDL_RCM_PLL2B_DIV_61
  *         @arg @ref DDL_RCM_PLL2B_DIV_62
  *         @arg @ref DDL_RCM_PLL2B_DIV_63
  * @param  PLL1A Between 50/192(*) and 432
  *
  *         (*) value not defined in all devices.
  * @param  PLLR This parameter can be one of the following values:
  *         @arg @ref DDL_RCM_PLL2C_DIV_2
  *         @arg @ref DDL_RCM_PLL2C_DIV_3
  *         @arg @ref DDL_RCM_PLL2C_DIV_4
  *         @arg @ref DDL_RCM_PLL2C_DIV_5
  *         @arg @ref DDL_RCM_PLL2C_DIV_6
  *         @arg @ref DDL_RCM_PLL2C_DIV_7
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_PLLI2S_ConfigDomain_I2S(uint32_t Source, uint32_t PLLB, uint32_t PLL1A, uint32_t PLLR)
{
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)((uint32_t)(&RCM->PLL1CFG) + (Source & 0x80U)));
  MODIFY_REG(*pReg, RCM_PLL1CFG_PLL1CLKS, (Source & (~0x80U)));
#if defined(RCM_PLL2CFG_PLL2B)
  MODIFY_REG(RCM->PLL2CFG, RCM_PLL2CFG_PLL2B, PLLB);
#else
  MODIFY_REG(RCM->PLL1CFG, RCM_PLL1CFG_PLLB, PLLB);
#endif /* RCM_PLL2CFG_PLL2B */
  MODIFY_REG(RCM->PLL2CFG, RCM_PLL2CFG_PLL2A | RCM_PLL2CFG_PLL2C, PLL1A << RCM_PLL2CFG_PLL2A_Pos | PLLR);
}

/**
  * @brief  Get I2SPLL multiplication factor for VCO
  * @retval Between 50/192(*) and 432
  *
  *         (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t DDL_RCM_PLLI2S_GetN(void)
{
  return (uint32_t)(READ_BIT(RCM->PLL2CFG, RCM_PLL2CFG_PLL2A) >> RCM_PLL2CFG_PLL2A_Pos);
}

/**
  * @brief  Get I2SPLL division factor for PLL2C
  * @note used for PLLI2SCLK (I2S clock)
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_PLL2C_DIV_2
  *         @arg @ref DDL_RCM_PLL2C_DIV_3
  *         @arg @ref DDL_RCM_PLL2C_DIV_4
  *         @arg @ref DDL_RCM_PLL2C_DIV_5
  *         @arg @ref DDL_RCM_PLL2C_DIV_6
  *         @arg @ref DDL_RCM_PLL2C_DIV_7
  */
__STATIC_INLINE uint32_t DDL_RCM_PLLI2S_GetR(void)
{
  return (uint32_t)(READ_BIT(RCM->PLL2CFG, RCM_PLL2CFG_PLL2C));
}

/**
  * @brief  Get division factor for PLLI2S input clock
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_PLL2B_DIV_2
  *         @arg @ref DDL_RCM_PLL2B_DIV_3
  *         @arg @ref DDL_RCM_PLL2B_DIV_4
  *         @arg @ref DDL_RCM_PLL2B_DIV_5
  *         @arg @ref DDL_RCM_PLL2B_DIV_6
  *         @arg @ref DDL_RCM_PLL2B_DIV_7
  *         @arg @ref DDL_RCM_PLL2B_DIV_8
  *         @arg @ref DDL_RCM_PLL2B_DIV_9
  *         @arg @ref DDL_RCM_PLL2B_DIV_10
  *         @arg @ref DDL_RCM_PLL2B_DIV_11
  *         @arg @ref DDL_RCM_PLL2B_DIV_12
  *         @arg @ref DDL_RCM_PLL2B_DIV_13
  *         @arg @ref DDL_RCM_PLL2B_DIV_14
  *         @arg @ref DDL_RCM_PLL2B_DIV_15
  *         @arg @ref DDL_RCM_PLL2B_DIV_16
  *         @arg @ref DDL_RCM_PLL2B_DIV_17
  *         @arg @ref DDL_RCM_PLL2B_DIV_18
  *         @arg @ref DDL_RCM_PLL2B_DIV_19
  *         @arg @ref DDL_RCM_PLL2B_DIV_20
  *         @arg @ref DDL_RCM_PLL2B_DIV_21
  *         @arg @ref DDL_RCM_PLL2B_DIV_22
  *         @arg @ref DDL_RCM_PLL2B_DIV_23
  *         @arg @ref DDL_RCM_PLL2B_DIV_24
  *         @arg @ref DDL_RCM_PLL2B_DIV_25
  *         @arg @ref DDL_RCM_PLL2B_DIV_26
  *         @arg @ref DDL_RCM_PLL2B_DIV_27
  *         @arg @ref DDL_RCM_PLL2B_DIV_28
  *         @arg @ref DDL_RCM_PLL2B_DIV_29
  *         @arg @ref DDL_RCM_PLL2B_DIV_30
  *         @arg @ref DDL_RCM_PLL2B_DIV_31
  *         @arg @ref DDL_RCM_PLL2B_DIV_32
  *         @arg @ref DDL_RCM_PLL2B_DIV_33
  *         @arg @ref DDL_RCM_PLL2B_DIV_34
  *         @arg @ref DDL_RCM_PLL2B_DIV_35
  *         @arg @ref DDL_RCM_PLL2B_DIV_36
  *         @arg @ref DDL_RCM_PLL2B_DIV_37
  *         @arg @ref DDL_RCM_PLL2B_DIV_38
  *         @arg @ref DDL_RCM_PLL2B_DIV_39
  *         @arg @ref DDL_RCM_PLL2B_DIV_40
  *         @arg @ref DDL_RCM_PLL2B_DIV_41
  *         @arg @ref DDL_RCM_PLL2B_DIV_42
  *         @arg @ref DDL_RCM_PLL2B_DIV_43
  *         @arg @ref DDL_RCM_PLL2B_DIV_44
  *         @arg @ref DDL_RCM_PLL2B_DIV_45
  *         @arg @ref DDL_RCM_PLL2B_DIV_46
  *         @arg @ref DDL_RCM_PLL2B_DIV_47
  *         @arg @ref DDL_RCM_PLL2B_DIV_48
  *         @arg @ref DDL_RCM_PLL2B_DIV_49
  *         @arg @ref DDL_RCM_PLL2B_DIV_50
  *         @arg @ref DDL_RCM_PLL2B_DIV_51
  *         @arg @ref DDL_RCM_PLL2B_DIV_52
  *         @arg @ref DDL_RCM_PLL2B_DIV_53
  *         @arg @ref DDL_RCM_PLL2B_DIV_54
  *         @arg @ref DDL_RCM_PLL2B_DIV_55
  *         @arg @ref DDL_RCM_PLL2B_DIV_56
  *         @arg @ref DDL_RCM_PLL2B_DIV_57
  *         @arg @ref DDL_RCM_PLL2B_DIV_58
  *         @arg @ref DDL_RCM_PLL2B_DIV_59
  *         @arg @ref DDL_RCM_PLL2B_DIV_60
  *         @arg @ref DDL_RCM_PLL2B_DIV_61
  *         @arg @ref DDL_RCM_PLL2B_DIV_62
  *         @arg @ref DDL_RCM_PLL2B_DIV_63
  */
__STATIC_INLINE uint32_t DDL_RCM_PLLI2S_GetDivider(void)
{
#if defined(RCM_PLL2CFG_PLL2B)
  return (uint32_t)(READ_BIT(RCM->PLL2CFG, RCM_PLL2CFG_PLL2B));
#else
  return (uint32_t)(READ_BIT(RCM->PLL1CFG, RCM_PLL1CFG_PLLB));
#endif /* RCM_PLL2CFG_PLL2B */
}

/**
  * @brief  Get the oscillator used as PLL clock source.
  * @retval Returned value can be one of the following values:
  *         @arg @ref DDL_RCM_PLLSOURCE_HSI
  *         @arg @ref DDL_RCM_PLLSOURCE_HSE
  *
  *         (*) value not defined in all devices.
  */
__STATIC_INLINE uint32_t DDL_RCM_PLLI2S_GetMainSource(void)
{
  return (uint32_t)(READ_BIT(RCM->PLL1CFG, RCM_PLL1CFG_PLL1CLKS));
}

/**
  * @}
  */
#endif /* RCM_PLLI2S_SUPPORT */

/** @defgroup RCM_DDL_EF_FLAG_Management FLAG Management
  * @{
  */

/**
  * @brief  Clear LSI ready interrupt flag
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ClearFlag_LSIRDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_LSIRDYCLR);
}

/**
  * @brief  Clear LSE ready interrupt flag
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ClearFlag_LSERDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_LSERDYCLR);
}

/**
  * @brief  Clear HSI ready interrupt flag
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ClearFlag_HSIRDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_HSIRDYCLR);
}

/**
  * @brief  Clear HSE ready interrupt flag
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ClearFlag_HSERDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_HSERDYCLR);
}

/**
  * @brief  Clear PLL ready interrupt flag
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ClearFlag_PLLRDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_PLL1RDYCLR);
}

#if defined(RCM_PLLI2S_SUPPORT)
/**
  * @brief  Clear PLLI2S ready interrupt flag
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ClearFlag_PLL2RDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_PLL2RDYCLR);
}

#endif /* RCM_PLLI2S_SUPPORT */

/**
  * @brief  Clear Clock security system interrupt flag
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ClearFlag_HSECSS(void)
{
  SET_BIT(RCM->INT, RCM_INT_CSSCLR);
}

/**
  * @brief  Check if LSI ready interrupt occurred or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_LSIRDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_LSIRDYFLG) == (RCM_INT_LSIRDYFLG));
}

/**
  * @brief  Check if LSE ready interrupt occurred or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_LSERDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_LSERDYFLG) == (RCM_INT_LSERDYFLG));
}

/**
  * @brief  Check if HSI ready interrupt occurred or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_HSIRDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_HSIRDYFLG) == (RCM_INT_HSIRDYFLG));
}

/**
  * @brief  Check if HSE ready interrupt occurred or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_HSERDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_HSERDYFLG) == (RCM_INT_HSERDYFLG));
}

/**
  * @brief  Check if PLL ready interrupt occurred or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_PLLRDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_PLL1RDYFLG) == (RCM_INT_PLL1RDYFLG));
}

#if defined(RCM_PLLI2S_SUPPORT)
/**
  * @brief  Check if PLLI2S ready interrupt occurred or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_PLL2RDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_PLL2RDYFLG) == (RCM_INT_PLL2RDYFLG));
}
#endif /* RCM_PLLI2S_SUPPORT */

/**
  * @brief  Check if Clock security system interrupt occurred or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_HSECSS(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_CSSFLG) == (RCM_INT_CSSFLG));
}

/**
  * @brief  Check if RCM flag Independent Watchdog reset is set or not.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_IWDTRST(void)
{
  return (READ_BIT(RCM->CSTS, RCM_CSTS_IWDTRSTFLG) == (RCM_CSTS_IWDTRSTFLG));
}

/**
  * @brief  Check if RCM flag Low Power reset is set or not.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_LPWRRST(void)
{
  return (READ_BIT(RCM->CSTS, RCM_CSTS_LPWRRSTFLG) == (RCM_CSTS_LPWRRSTFLG));
}

/**
  * @brief  Check if RCM flag Pin reset is set or not.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_PINRST(void)
{
  return (READ_BIT(RCM->CSTS, RCM_CSTS_PINRSTFLG) == (RCM_CSTS_PINRSTFLG));
}

/**
  * @brief  Check if RCM flag POR/PDR reset is set or not.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_PORRST(void)
{
  return (READ_BIT(RCM->CSTS, RCM_CSTS_PODRSTFLG) == (RCM_CSTS_PODRSTFLG));
}

/**
  * @brief  Check if RCM flag Software reset is set or not.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_SFTRST(void)
{
  return (READ_BIT(RCM->CSTS, RCM_CSTS_SWRSTFLG) == (RCM_CSTS_SWRSTFLG));
}

/**
  * @brief  Check if RCM flag Window Watchdog reset is set or not.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_WWDTRST(void)
{
  return (READ_BIT(RCM->CSTS, RCM_CSTS_WWDTRSTFLG) == (RCM_CSTS_WWDTRSTFLG));
}

#if defined(RCM_CSTS_BORRSTFLG)
/**
  * @brief  Check if RCM flag BOR reset is set or not.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsActiveFlag_BORRST(void)
{
  return (READ_BIT(RCM->CSTS, RCM_CSTS_BORRSTFLG) == (RCM_CSTS_BORRSTFLG));
}
#endif /* RCM_CSTS_BORRSTFLG */

/**
  * @brief  Set RMVF bit to clear the reset flags.
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_ClearResetFlags(void)
{
  SET_BIT(RCM->CSTS, RCM_CSTS_RSTFLGCLR);
}

/**
  * @}
  */

/** @defgroup RCM_DDL_EF_IT_Management IT Management
  * @{
  */

/**
  * @brief  Enable LSI ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_EnableIT_LSIRDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_LSIRDYEN);
}

/**
  * @brief  Enable LSE ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_EnableIT_LSERDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_LSERDYEN);
}

/**
  * @brief  Enable HSI ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_EnableIT_HSIRDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_HSIRDYEN);
}

/**
  * @brief  Enable HSE ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_EnableIT_HSERDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_HSERDYEN);
}

/**
  * @brief  Enable PLL ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_EnableIT_PLLRDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_PLL1RDYEN);
}

#if defined(RCM_PLLI2S_SUPPORT)
/**
  * @brief  Enable PLLI2S ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_EnableIT_PLL2RDY(void)
{
  SET_BIT(RCM->INT, RCM_INT_PLL2RDYEN);
}
#endif /* RCM_PLLI2S_SUPPORT */

/**
  * @brief  Disable LSI ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_DisableIT_LSIRDY(void)
{
  CLEAR_BIT(RCM->INT, RCM_INT_LSIRDYEN);
}

/**
  * @brief  Disable LSE ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_DisableIT_LSERDY(void)
{
  CLEAR_BIT(RCM->INT, RCM_INT_LSERDYEN);
}

/**
  * @brief  Disable HSI ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_DisableIT_HSIRDY(void)
{
  CLEAR_BIT(RCM->INT, RCM_INT_HSIRDYEN);
}

/**
  * @brief  Disable HSE ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_DisableIT_HSERDY(void)
{
  CLEAR_BIT(RCM->INT, RCM_INT_HSERDYEN);
}

/**
  * @brief  Disable PLL ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_DisableIT_PLLRDY(void)
{
  CLEAR_BIT(RCM->INT, RCM_INT_PLL1RDYEN);
}

#if defined(RCM_PLLI2S_SUPPORT)
/**
  * @brief  Disable PLLI2S ready interrupt
  * @retval None
  */
__STATIC_INLINE void DDL_RCM_DisableIT_PLL2RDY(void)
{
  CLEAR_BIT(RCM->INT, RCM_INT_PLL2RDYEN);
}

#endif /* RCM_PLLI2S_SUPPORT */

/**
  * @brief  Checks if LSI ready interrupt source is enabled or disabled.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsEnabledIT_LSIRDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_LSIRDYEN) == (RCM_INT_LSIRDYEN));
}

/**
  * @brief  Checks if LSE ready interrupt source is enabled or disabled.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsEnabledIT_LSERDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_LSERDYEN) == (RCM_INT_LSERDYEN));
}

/**
  * @brief  Checks if HSI ready interrupt source is enabled or disabled.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsEnabledIT_HSIRDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_HSIRDYEN) == (RCM_INT_HSIRDYEN));
}

/**
  * @brief  Checks if HSE ready interrupt source is enabled or disabled.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsEnabledIT_HSERDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_HSERDYEN) == (RCM_INT_HSERDYEN));
}

/**
  * @brief  Checks if PLL ready interrupt source is enabled or disabled.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsEnabledIT_PLLRDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_PLL1RDYEN) == (RCM_INT_PLL1RDYEN));
}

#if defined(RCM_PLLI2S_SUPPORT)
/**
  * @brief  Checks if PLLI2S ready interrupt source is enabled or disabled.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_RCM_IsEnabledIT_PLL2RDY(void)
{
  return (READ_BIT(RCM->INT, RCM_INT_PLL2RDYEN) == (RCM_INT_PLL2RDYEN));
}

#endif /* RCM_PLLI2S_SUPPORT */

/**
  * @}
  */

#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup RCM_DDL_EF_Init De-initialization function
  * @{
  */
ErrorStatus DDL_RCM_DeInit(void);
/**
  * @}
  */

/** @defgroup RCM_DDL_EF_Get_Freq Get system and peripherals clocks frequency functions
  * @{
  */
void        DDL_RCM_GetSystemClocksFreq(DDL_RCM_ClocksTypeDef *RCM_Clocks);
#if defined(SDIO)
uint32_t    DDL_RCM_GetSDIOClockFreq(uint32_t SDIOxSource);
#endif /* SDIO */
#if defined(RNG)
uint32_t    DDL_RCM_GetRNGClockFreq(uint32_t RNGxSource);
#endif /* RNG */
#if defined(USB_OTG_FS) || defined(USB_OTG_HS) || defined(USB_OTG_FS2)
uint32_t    DDL_RCM_GetUSBClockFreq(uint32_t USBxSource);
#endif /* USB_OTG_FS || USB_OTG_HS || USB_OTG_FS2 */
uint32_t    DDL_RCM_GetI2SClockFreq(uint32_t I2SxSource);
#if defined(RCM_CFG_ADCPSC)
uint32_t DDL_RCM_GetADCClockFreq(uint32_t ADCxSource);
#endif /* RCM_CFG_ADCPSC */
/**
  * @}
  */
#endif /* USE_FULL_DDL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCM) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DDL_RCM_H */

